*********** Convertido de OS/VS COBOL p/ COBOL for MVS em 14/01/08 14:46
      *************************                                         
       IDENTIFICATION DIVISION.                                         
      **************************                                        
       PROGRAM-ID. CLLP8780.                                            
      *REMARKS.                                                         
      *******************************************-                      
      *       C P M  -  S I S T E M A S          *                      
      ********************************************                      
      *  PROGRAMA    - CLLP8780                  *                      
      *  PROGRAMADOR - FLAVIA ZANETTI - CPM      *                      
      *  ANALISTA    - AMERICO        - GP 82    *                      
      *  DATA        - JUNHO/1997                *                      
      ********************************************                      
      *  OBJETIVO    -                           *                      
      *     MONTAR ARQUIVO P/ROTINA 0292.        *                      
      ********************************************                      
STF   *===============================================================* 
STF   *                       ULTIMA ALTERACAO                        * 
STF   *---------------------------------------------------------------* 
STF   *                                                               * 
STF   *   PROGRAMADOR : JEFERSON AMARAL  - STEFANINI                  * 
STF   *   SUPERVISOR  : RICARDO PINHO    - STEFANINI                  * 
STF   *   ANALISTA    : MAGDA            - CPM                        * 
STF   *   DATA        : 20/05/2002                                    * 
STF   *                                                               * 
STF   *   OBJETIVO    : ALTERACOES SOLICITADAS PELO BANCO CENTRAL     * 
STF   *                 PARA A NOVA CENTRAL DE RISCO.                 * 
STF   *                                                               * 
JH0404*===============================================================* 
JH0404*                       ULTIMA ALTERACAO                        * 
JH0404*---------------------------------------------------------------* 
JH0404*                                                               * 
JH0404*   PROGRAMADOR : JOSE HUMBERTO    - GP 70                      * 
JH0404*   ANALISTA    : JOSE HUMBERTO    - GP 70                      * 
JH0404*   DATA        : ABRIL/2004                                    * 
JH0404*                                                               * 
JH0404*   OBJETIVO    : ALTERAR CODIGO DE EMPRESA DE 5240 P/ 7256     * 
JH0404*   OBJETIVO    : ALTERAR CODIGO DE EMPRESA DE 5240 P/ 7036     * 
JH0404*                                                               * 
JH0404*===============================================================* 
      *                                                                 
      ***********************                                           
       ENVIRONMENT DIVISION.                                            
      ***********************                                           
                                                                        
       CONFIGURATION SECTION.                                           
      *---------------------*                                           
                                                                        
      *SOURCE-COMPUTER.                                                 
      *    IBM-370 WITH DEBUGGING MODE.                                 
                                                                        
       SPECIAL-NAMES.                                                   
           DECIMAL-POINT IS COMMA.                                      
                                                                        
       INPUT-OUTPUT SECTION.                                            
      *--------------------*                                            
       FILE-CONTROL.                                                    
                                                                        
           SELECT ARQDATA  ASSIGN  TO  UT-S-ARQDATA.                    
           SELECT ARQ292   ASSIGN  TO  UT-S-ARQ292.                     
           SELECT RELATO   ASSIGN  TO  UT-S-RELATO.                     
           SELECT RELPEND  ASSIGN  TO  UT-S-RELPEND.                    
           SELECT ARQSORT  ASSIGN  TO  UT-S-ARQSORT.                    
STF        SELECT SGARANTI ASSIGN  TO  UT-S-GARANTI.                    
      /                                                                 
      ****************                                                  
       DATA DIVISION.                                                   
      ****************                                                  
       FILE SECTION.                                                    
      *-------------*                                                   
                                                                        
      *---------------------------------------------------------------* 
      *    ARQDATA         -      INPUT        -         LRECL = 060  * 
      *---------------------------------------------------------------* 
       FD  ARQDATA                                                      
           RECORDING F                                                  
           LABEL RECORD STANDARD                                        
           BLOCK 0.                                                     
                                                                        
       01  REG-DATA.                                                    
           03  FILLER             PIC X(10).                            
           03  DATA-DIA           PIC 9(08).                            
           03  FILLER             PIC X(42).                            
                                                                        
      *---------------------------------------------------------------* 
STF   *    ARQ292          -      OUTPUT       -         LRECL = 180  * 
      *---------------------------------------------------------------* 
       FD  ARQ292                                                       
           RECORDING F                                                  
           LABEL RECORD STANDARD                                        
           BLOCK 0.                                                     
                                                                        
STF    01  REG-292.                                                     
STF        05  LPCL-292                PIC  X(04).                      
STF        05  AGENC-292               PIC  9(05) COMP-3.               
STF        05  CONTA-292               PIC  9(13) COMP-3.               
STF        05  CARTEIRA-292            PIC  X(03).                      
STF        05  CONTRATO-292            PIC  9(17) COMP-3.               
STF        05  EMPRESA-292             PIC  9(05) COMP-3.               
STF        05  RAZAO-C-292.                                             
STF            07  GRUPO-CONTAB-292    PIC  9(03) COMP-3.               
STF            07  SUBGRUPO-CONTAB-292 PIC  9(03) COMP-3.               
STF        05  SITUACAO-292            PIC  9(01).                      
STF        05  TIPOREG-292             PIC  X(01).                      
STF        05  RAZAO-292.                                               
STF            07  GRUPO-CC-292        PIC  9(03) COMP-3.               
STF            07  SUBGRUPO-CC-292     PIC  9(03) COMP-3.               
STF        05  AGENC-C-292             PIC  9(05) COMP-3.               
STF        05  FIXO-292                PIC  9(01).                      
STF        05  MES-292                 PIC  9(02).                      
STF        05  ANO-292                 PIC  9(04).                      
STF        05  NRO-CGC-292             PIC  9(09) COMP-3.               
STF        05  FIL-CGC-292             PIC  9(05) COMP-3.               
STF        05  CTR-CGC-292             PIC  9(03) COMP-3.               
STF        05  TIPO-CLIENTE-292        PIC  9(01).                      
STF        05  NOME-292                PIC  X(40).                      
STF        05  PRAZO-292               PIC  9(02).                      
STF        05  VALOR-292               PIC  9(15)V99 COMP-3.            
STF        05  GARANTIA-292            PIC  9(05) COMP-3.               
STF        05  CGCCPF-COOBR-292.                                        
STF            07  NRO-CGC-COOBR-292   PIC  9(09) COMP-3.               
STF            07  FIL-CGC-COOBR-292   PIC  9(05) COMP-3.               
STF            07  CTR-CGC-COOBR-292   PIC  9(03) COMP-3.               
STF        05  CLASS-OPER-292          PIC  X(02).                      
STF        05  NATUREZA-OPERACAO-292   PIC  9(02).                      
STF        05  ORIGEM-RECURSO-292      PIC  9(04).                      
STF        05  TAXA-REFERENCIAL-292    PIC  9(02).                      
STF        05  VARIACAO-CAMBIAL-292    PIC  9(03).                      
STF        05  TAXA-EFETIVA-ANUAL-292  PIC  9(04)V9(07) COMP-3.         
STF        05  CARAC-ESPECIAL-292      PIC  9(02).                      
STF        05  DT-INIC-OPER-292        PIC  9(09) COMP-3.               
STF        05  DT-MENOR-VENCTO-292     PIC  9(09) COMP-3.               
STF        05  DT-MAIOR-VENCTO-292     PIC  9(09) COMP-3.               
STF        05  EXCLUSIVO-USGAAP-292.                                    
STF            07  INDICADORES-292.                                     
STF                09  TAXA-292        PIC S9(03)V9(02) COMP-3.         
STF                09  INDEXADOR-292   PIC  9(02).                      
STF                09  PERIODIC-292    PIC  9(01).                      
STF            07  TX-CONTR-FV-292 REDEFINES INDICADORES-292            
STF                                    PIC S9(04)V9(07) COMP-3.         
STF        05  PRODUTO-292             PIC S9(03) COMP-3.               
STF        05  FAMILIA-292             PIC S9(01) COMP-3.               
STF        05  ID-292                  PIC  X(03).                      
STF        05  RESERVA-292             PIC  X(08).                      
                                                                        
      *---------------------------------------------------------------* 
      *    RELATO          -      OUTPUT       -         LRECL = 133  * 
      *---------------------------------------------------------------* 
       FD  RELATO                                                       
           RECORDING F                                                  
           LABEL RECORD STANDARD                                        
           BLOCK 0.                                                     
                                                                        
       01  REL-REG                PIC X(133).                           
                                                                        
      *---------------------------------------------------------------* 
      *    RELPEND           -     OUTPUT     -           LRECL = 133 * 
      *---------------------------------------------------------------* 
       FD  RELPEND                                                      
           BLOCK 0                                                      
           RECORDING F                                                  
           LABEL RECORD STANDARD.                                       
                                                                        
       01  REG-RELPEND                 PIC X(133).                      
                                                                        
      *---------------------------------------------------------------* 
      *    ARQSORT                                       LRECL = 035  * 
      *---------------------------------------------------------------* 
       SD  ARQSORT.                                                     
                                                                        
       01  REG-SORT.                                                    
           03  SRT-EMPRESA        PIC 9(05)    COMP-3.                  
           03  SRT-QTDE           PIC 9(11)    COMP-3.                  
           03  SRT-VLR-CONTABIL   PIC 9(13)V99 COMP-3.                  
           03  SRT-VLR-ENC-VENC   PIC 9(13)V99 COMP-3.                  
           03  SRT-VLR-TOTAL      PIC 9(13)V99 COMP-3.                  
           03  SRT-TIPO           PIC 9(01).                            
           03  SRT-EXERCICIO      PIC 9(01).                            
                                                                        
STF   *---------------------------------------------------------------* 
STF   *    SGARANTI          -     OUTPUT     -           LRECL = 057 * 
STF   *---------------------------------------------------------------* 
STF    FD  SGARANTI                                                     
STF        BLOCK 0                                                      
STF        RECORDING F                                                  
STF        LABEL RECORD STANDARD.                                       
STF                                                                     
       01  REG-GARANTIA.                                                
           03  GAR-CENTRO-CUSTO            PIC  X(04).                  
           03  GAR-AGENCIA                 PIC  9(05)       COMP-3.     
           03  GAR-CONTA                   PIC  9(13)       COMP-3.     
           03  GAR-CARTEIRA                PIC  X(03).                  
           03  GAR-CONTRATO                PIC  9(17)       COMP-3.     
           03  GAR-EMPRESA                 PIC  9(05)       COMP-3.     
           03  GAR-TIPO-GARANTIA           PIC  9(05)       COMP-3.     
           03  GAR-NUMERO-COOBRIGADO       PIC  9(09)       COMP-3.     
           03  GAR-FILIAL-COOBRIGADO       PIC  9(05)       COMP-3.     
           03  GAR-CONTR-COOBRIGADO        PIC  9(03)       COMP-3.     
           03  GAR-TIPO-GARANTIDOR         PIC  9(01).                  
           03  GAR-VALOR-GARANTIA          PIC  9(15)V9(02) COMP-3.     
           03  GAR-DT-ULTIMA-AVALIACAO     PIC  9(09)       COMP-3.     
                                                                        
      /                                                                 
      *========================*                                        
       WORKING-STORAGE SECTION.                                         
      *========================*                                        
                                                                        
       77  FILLER                  PIC  X(035) VALUE                    
           '**** INICIO DA WORKING-STORAGE ****'.                       
                                                                        
      *---------------------------------------------------------------* 
      *                       CONTROLADORES                           * 
      *---------------------------------------------------------------* 
                                                                        
       77  WRK-VR-LIQUIDO             PIC S9(013)V99 VALUE ZEROS.       
       77  WRK-VRENCVEN               PIC  9(013)V99 VALUE ZEROS.       
       77  WRK-DATA-WRITEOFF          PIC  9(09) VALUE ZEROS.           
       77  WRK-ABEND                  PIC S9(04) COMP  VALUE +1111.     
       77  ACU-LIN                    PIC  9(002) VALUE 61.             
       77  ACU-PAG                    PIC  9(006) VALUE ZEROS.          
       77  WRK-CONT-95                PIC  9(005) VALUE ZEROS.          
       77  WRK-CONT-LIN               PIC  9(002) VALUE 61.             
       77  WRK-CONT-PAG               PIC  9(005) VALUE ZEROS.          
       77  WRK-IMPRIMIR               PIC  X(001) VALUE 'S'.            
       77  WRK-BRANCO                 PIC  X(133) VALUE SPACES.         
       77  WRK-ARQVAZIO               PIC  X(001) VALUE SPACES.         
       77  WRK-ANO-DTDIA              PIC  9(004) VALUE ZEROS.          
       77  WRK-RAZAO-REL              PIC  9(005) VALUE ZEROS.          
       77  WRK-VALOR                  PIC  9(013)V99    VALUE ZEROS.    
                                                                        
      *---------------------------------------------------------------* 
      *   AREA PARA GUARDAR A AGENCIA / CARTEIRA / EMPRESA ANTERIOR   * 
      *---------------------------------------------------------------* 
                                                                        
       77  WRK-AGENCIA-ANT             PIC  9(005) COMP-3 VALUE ZEROS.  
       77  WRK-CARTEIRA-ANT            PIC  X(003) VALUE ZEROS.         
       77  WRK-EMP-ANT                 PIC  9(005) COMP-3 VALUE ZEROS.  
       77  WRK-EMPRESA-ANT             PIC  9(005) COMP-3 VALUE ZEROS.  
       77  WRK-TIPO-ANT                PIC  9(001)        VALUE ZEROS.  
       77  WRK-EXER-ANT                PIC  9(001)        VALUE ZEROS.  
                                                                        
      *---------------------------------------------------------------* 
      *                  CONTADORES E ACUMULADORES                    * 
      *---------------------------------------------------------------* 
                                                                        
      **************************** RELATO ******************************
      *------------------ACUMULADORES LINHAS DE DETALHE----------------*
       77  ACU-QTDE-CL                 PIC 9(11)    COMP-3 VALUE ZEROS. 
       77  ACU-VLR-CON-CL              PIC 9(13)V99 COMP-3 VALUE ZEROS. 
       77  ACU-VLR-ENC-CL              PIC 9(13)V99 COMP-3 VALUE ZEROS. 
       77  ACU-VLR-TOT-CL              PIC 9(13)V99 COMP-3 VALUE ZEROS. 
                                                                        
       77  ACU-QTDE-PREJ-LP            PIC 9(11)    COMP-3 VALUE ZEROS. 
       77  ACU-VLR-CON-PREJ-LP         PIC 9(13)V99 COMP-3 VALUE ZEROS. 
       77  ACU-VLR-ENC-PREJ-LP         PIC 9(13)V99 COMP-3 VALUE ZEROS. 
       77  ACU-VLR-TOT-PREJ-LP         PIC 9(13)V99 COMP-3 VALUE ZEROS. 
                                                                        
       77  ACU-QTDE-PREJ-ANT-LP        PIC 9(11)    COMP-3 VALUE ZEROS. 
       77  ACU-VLR-CON-PREJ-ANT-LP     PIC 9(13)V99 COMP-3 VALUE ZEROS. 
       77  ACU-VLR-ENC-PREJ-ANT-LP     PIC 9(13)V99 COMP-3 VALUE ZEROS. 
       77  ACU-VLR-TOT-PREJ-ANT-LP     PIC 9(13)V99 COMP-3 VALUE ZEROS. 
                                                                        
       77  ACU-QTDE-PREJ-CL3           PIC 9(11)    COMP-3 VALUE ZEROS. 
       77  ACU-VLR-CON-PREJ-CL3        PIC 9(13)V99 COMP-3 VALUE ZEROS. 
       77  ACU-VLR-ENC-PREJ-CL3        PIC 9(13)V99 COMP-3 VALUE ZEROS. 
       77  ACU-VLR-TOT-PREJ-CL3        PIC 9(13)V99 COMP-3 VALUE ZEROS. 
                                                                        
       77  ACU-QTDE-PREJ-ANT-CL3       PIC 9(11)    COMP-3 VALUE ZEROS. 
       77  ACU-VLR-CON-PREJ-ANT-CL3    PIC 9(13)V99 COMP-3 VALUE ZEROS. 
       77  ACU-VLR-ENC-PREJ-ANT-CL3    PIC 9(13)V99 COMP-3 VALUE ZEROS. 
       77  ACU-VLR-TOT-PREJ-ANT-CL3    PIC 9(13)V99 COMP-3 VALUE ZEROS. 
                                                                        
       77  ACU-QTDE-PREJ-CL2           PIC 9(11)    COMP-3 VALUE ZEROS. 
       77  ACU-VLR-CON-PREJ-CL2        PIC 9(13)V99 COMP-3 VALUE ZEROS. 
       77  ACU-VLR-ENC-PREJ-CL2        PIC 9(13)V99 COMP-3 VALUE ZEROS. 
       77  ACU-VLR-TOT-PREJ-CL2        PIC 9(13)V99 COMP-3 VALUE ZEROS. 
                                                                        
       77  ACU-QTDE-PREJ-ANT-CL2       PIC 9(11)    COMP-3 VALUE ZEROS. 
       77  ACU-VLR-CON-PREJ-ANT-CL2    PIC 9(13)V99 COMP-3 VALUE ZEROS. 
       77  ACU-VLR-ENC-PREJ-ANT-CL2    PIC 9(13)V99 COMP-3 VALUE ZEROS. 
       77  ACU-VLR-TOT-PREJ-ANT-CL2    PIC 9(13)V99 COMP-3 VALUE ZEROS. 
                                                                        
STF    77  ACU-QTDE-PREJ-MAIS-LP       PIC  9(11)    COMP-3 VALUE ZEROS.
STF    77  ACU-VLR-CON-PREJ-MAIS-LP    PIC  9(13)V99 COMP-3 VALUE ZEROS.
STF    77  ACU-VLR-ENC-PREJ-MAIS-LP    PIC  9(13)V99 COMP-3 VALUE ZEROS.
                                                                        
STF    77  ACU-QTDE-PREJ-MAIS-CL3      PIC  9(11)    COMP-3 VALUE ZEROS.
STF    77  ACU-VLR-CON-PREJ-MAIS-CL3   PIC  9(13)V99 COMP-3 VALUE ZEROS.
STF    77  ACU-VLR-ENC-PREJ-MAIS-CL3   PIC  9(13)V99 COMP-3 VALUE ZEROS.
                                                                        
STF    77  ACU-QTDE-PREJ-MAIS-CL2      PIC  9(11)    COMP-3 VALUE ZEROS.
STF    77  ACU-VLR-CON-PREJ-MAIS-CL2   PIC  9(13)V99 COMP-3 VALUE ZEROS.
STF    77  ACU-VLR-ENC-PREJ-MAIS-CL2   PIC  9(13)V99 COMP-3 VALUE ZEROS.
                                                                        
STF    77  WRK-DTPRAZO-D360            PIC  9(09)    COMP-3 VALUE ZEROS.
STF    77  WRK-DTPRAZO-D1440           PIC  9(09)    COMP-3 VALUE ZEROS.
                                                                        
      *-----------------ACUMULADORES LINHA DE TOTAIS-------------------*
       77  ACU-EX-QTDE                 PIC 9(11)    COMP-3 VALUE ZEROS. 
       77  ACU-EX-VLR-CON              PIC 9(13)V99 COMP-3 VALUE ZEROS. 
       77  ACU-EX-VLR-ENC              PIC 9(13)V99 COMP-3 VALUE ZEROS. 
       77  ACU-EX-VLR-TOT              PIC 9(13)V99 COMP-3 VALUE ZEROS. 
                                                                        
       77  ACU-TP-QTDE                 PIC 9(11)    COMP-3 VALUE ZEROS. 
       77  ACU-TP-VLR-CON              PIC 9(13)V99 COMP-3 VALUE ZEROS. 
       77  ACU-TP-VLR-ENC              PIC 9(13)V99 COMP-3 VALUE ZEROS. 
       77  ACU-TP-VLR-TOT              PIC 9(13)V99 COMP-3 VALUE ZEROS. 
                                                                        
       77  ACU-EMP-QTDE                PIC 9(11)    COMP-3 VALUE ZEROS. 
       77  ACU-EMP-VLR-CON             PIC 9(13)V99 COMP-3 VALUE ZEROS. 
       77  ACU-EMP-VLR-ENC             PIC 9(13)V99 COMP-3 VALUE ZEROS. 
       77  ACU-EMP-VLR-TOT             PIC 9(13)V99 COMP-3 VALUE ZEROS. 
                                                                        
       77  ACU-GER-QTDE                PIC 9(11)    COMP-3 VALUE ZEROS. 
       77  ACU-GER-VLR-CON             PIC 9(13)V99 COMP-3 VALUE ZEROS. 
       77  ACU-GER-VLR-ENC             PIC 9(13)V99 COMP-3 VALUE ZEROS. 
       77  ACU-GER-VLR-TOT             PIC 9(13)V99 COMP-3 VALUE ZEROS. 
                                                                        
                                                                        
      *************************** RELPEND ***************************** 
      *------------------ACUMULADORES POR CARTEIRA--------------------* 
       77  ACU-TOTAL-CART              PIC  9(012)V99 VALUE ZEROS.      
       77  ACU-PRINC-CART              PIC  9(012)V99 VALUE ZEROS.      
       77  ACU-ENCAR-CART              PIC  9(012)V99 VALUE ZEROS.      
                                                                        
      *------------------ACUMULADORES POR AGENCIA---------------------* 
       77  ACU-TOTAL-AGEN              PIC  9(012)V99 VALUE ZEROS.      
       77  ACU-PRINC-AGEN              PIC  9(012)V99 VALUE ZEROS.      
       77  ACU-ENCAR-AGEN              PIC  9(012)V99 VALUE ZEROS.      
                                                                        
      *---------------------ACUMULADORES GERAIS-----------------------* 
       77  ACU-TOTAL-GERAL             PIC  9(012)V99 VALUE ZEROS.      
       77  ACU-PRINC-GERAL             PIC  9(012)V99 VALUE ZEROS.      
       77  ACU-ENCAR-GERAL             PIC  9(012)V99 VALUE ZEROS.      
                                                                        
                                                                        
      * AREAS UTILIZADAS PELO MODULO RISC5020 *                         
                                                                        
STF    77  WRK-MODULO                  PIC  X(08)    VALUE 'RISC5020'.  
STF    77  WRK-DATA-BASE               PIC  9(08)    VALUE ZEROS.       
STF    77  WRK-DATA-VENCTO             PIC  9(08)    VALUE ZEROS.       
STF    77  WRK-PRAZO                   PIC  9(02)    VALUE ZEROS.       
                                                                        
      * AREAS UTILIZADAS PELA POOL0025 *                                
                                                                        
       77  WRK-DATA-POOL0025           PIC  9(09)    COMP-3 VALUE ZEROS.
       77  WRK-DIAS                    PIC S9(05)    COMP-3 VALUE ZEROS.
                                                                        
      * DATAS VENCIDAS *                                                
                                                                        
       77  WRK-DTPRAZO1-VENCD          PIC  9(09)    COMP-3 VALUE ZEROS.
       77  WRK-DTPRAZO2-VENCD          PIC  9(09)    COMP-3 VALUE ZEROS.
       77  WRK-DTPRAZO3-VENCD          PIC  9(09)    COMP-3 VALUE ZEROS.
       77  WRK-DTPRAZO4-VENCD          PIC  9(09)    COMP-3 VALUE ZEROS.
       77  WRK-DTPRAZO5-VENCD          PIC  9(09)    COMP-3 VALUE ZEROS.
       77  WRK-DTPRAZO6-VENCD          PIC  9(09)    COMP-3 VALUE ZEROS.
       77  WRK-DTPRAZO7-VENCD          PIC  9(09)    COMP-3 VALUE ZEROS.
       77  WRK-DTPRAZO8-VENCD          PIC  9(09)    COMP-3 VALUE ZEROS.
       77  WRK-DTPRAZO9-VENCD          PIC  9(09)    COMP-3 VALUE ZEROS.
       77  WRK-DTPRAZO0-VENCD          PIC  9(09)    COMP-3 VALUE ZEROS.
                                                                        
      * DATAS VINCENDAS *                                               
                                                                        
       77  WRK-DTPRAZO1-VINCD          PIC  9(09)    COMP-3 VALUE ZEROS.
       77  WRK-DTPRAZO2-VINCD          PIC  9(09)    COMP-3 VALUE ZEROS.
       77  WRK-DTPRAZO3-VINCD          PIC  9(09)    COMP-3 VALUE ZEROS.
       77  WRK-DTPRAZO4-VINCD          PIC  9(09)    COMP-3 VALUE ZEROS.
       77  WRK-DTPRAZO5-VINCD          PIC  9(09)    COMP-3 VALUE ZEROS.
       77  WRK-DTPRAZO6-VINCD          PIC  9(09)    COMP-3 VALUE ZEROS.
       77  WRK-DTPRAZO7-VINCD          PIC  9(09)    COMP-3 VALUE ZEROS.
       77  WRK-DTPRAZO8-VINCD          PIC  9(09)    COMP-3 VALUE ZEROS.
       77  WRK-DTPRAZO9-VINCD          PIC  9(09)    COMP-3 VALUE ZEROS.
       77  WRK-DTPRAZO0-VINCD          PIC  9(09)    COMP-3 VALUE ZEROS.
                                                                        
      * CHAVE PARA LEITURA DO CADALPCL. (ARQ. COMPRIMIDO) *             
       77  WRK-CAD                     PIC X(08)    VALUE  'CADALPCL'.  
                                                                        
      * AREA AUXLIAR PARA CHAVE *                                       
STF    01  WRK-REG-AUX                 PIC  X(180).                     
      /                                                                 
      * AREA PARA RECEBER O REGISTRO DO CADALPCL  *                     
                                                                        
       01  WRK-REG.                                                     
           03  CAD-EMPRESA             PIC  9(05)    COMP-3.            
           03  CAD-AG                  PIC  9(05)    COMP-3.            
           03  CAD-NUMCL               PIC  9(15)    COMP-3.            
           03  CAD-DIG                 PIC  X(01).                      
           03  CAD-CONTA               PIC  9(07)    COMP-3.            
           03  CAD-COD-INDEP           PIC  9(05)    COMP-3.            
           03  CAD-SIGLA               PIC  X(04).                      
           03  CAD-CART                PIC  9(03)    COMP-3.            
           03  CAD-CONTR               PIC  9(07)    COMP-3.            
           03  CAD-CART2               PIC  X(03).                      
           03  CAD-RZENTCL             PIC  9(05)    COMP-3.            
           03  CAD-CTENTCL             PIC  9(07)    COMP-3.            
           03  CAD-RZRENDAS            PIC  9(05)    COMP-3.            
           03  CAD-CTRENDAS            PIC  9(07)    COMP-3.            
           03  CAD-VCTO                PIC  9(09)    COMP-3.            
           03  CAD-DATA                PIC  9(09)    COMP-3.            
           03  CAD-DTBCL               PIC  9(09)    COMP-3.            
           03  CAD-DTIOP               PIC  9(09)    COMP-3.            
           03  CAD-DTPRO               PIC  9(09)    COMP-3.            
           03  CAD-DTELP               PIC  9(09)    COMP-3.            
           03  CAD-DTBLP               PIC  9(09)    COMP-3.            
           03  CAD-DTPGTO              PIC  9(09)    COMP-3.            
           03  CAD-MOVTO               PIC  9(09)    COMP-3.            
           03  CAD-DTREX               PIC  9(09)    COMP-3.            
           03  CAD-DTVTR               PIC  9(09)    COMP-3.            
           03  CAD-VRDVI               PIC  9(13)V99 COMP-3.            
           03  CAD-VLR-RESG            PIC  9(13)V99 COMP-3.            
           03  CAD-VRBXA               PIC  9(13)V99 COMP-3.            
           03  CAD-VBASE               PIC  9(13)V99 COMP-3.            
           03  CAD-VRBBX               PIC  9(13)V99 COMP-3.            
           03  CAD-COBRM               PIC  9(13)V99 COMP-3.            
           03  CAD-COBRB               PIC  9(13)V99 COMP-3.            
           03  CAD-DEBCC               PIC  9(13)V99 COMP-3.            
           03  CAD-COBRD               PIC  9(13)V99 COMP-3.            
           03  CAD-VRENCVEN            PIC  9(13)V99 COMP-3.            
           03  CAD-VREVI               PIC  9(13)V99 COMP-3.            
           03  CAD-VRINI               PIC  9(13)V99 COMP-3.            
           03  CAD-BXINI               PIC  9(13)V99 COMP-3.            
           03  CAD-VRIOF               PIC  9(13)V99 COMP-3.            
           03  CAD-BXIOF               PIC  9(13)V99 COMP-3.            
           03  CAD-ANTEX               PIC  9(13)V99 COMP-3.            
           03  CAD-MOEDA               PIC  X(02).                      
           03  CAD-MOEDA-ANT           PIC  X.                          
           03  CAD-TELEF               PIC  9(07)    COMP-3.            
           03  CAD-NOME                PIC  X(40).                      
           03  CAD-CGC.                                                 
               05  CAD-NCGC            PIC  9(09)    COMP-3.            
               05  CAD-FIL             PIC  9(05)    COMP-3.            
               05  CAD-CTR             PIC  9(03)    COMP-3.            
           03  CAD-NOME1               PIC  X(40).                      
           03  CAD-CGC1.                                                
               05  CAD-NCGC1           PIC  9(09)    COMP-3.            
               05  CAD-FIL1            PIC  9(05)    COMP-3.            
               05  CAD-CTR1            PIC  9(03)    COMP-3.            
           03  CAD-NOME2               PIC  X(40).                      
           03  CAD-CGC2.                                                
               05  CAD-NCGC2           PIC  9(09)    COMP-3.            
               05  CAD-FIL2            PIC  9(05)    COMP-3.            
               05  CAD-CTR2            PIC  9(03)    COMP-3.            
           03  CAD-TPGAR               PIC  X(02).                      
           03  CAD-NMGAR               PIC  X(32).                      
           03  CAD-STARET              PIC  X(01).                      
           03  CAD-TRAG                PIC  9(07)    COMP-3.            
           03  CAD-AGANT               PIC  9(07)    COMP-3.            
           03  CAD-DTTRANSF            PIC  9(09)    COMP-3.            
           03  CAD-DTRETCL             PIC  9(09)    COMP-3.            
           03  CAD-DTWOFF              PIC  9(09)    COMP-3.            
           03  CAD-ENCVENC             PIC  9(13)V99 COMP-3.            
           03  FILLER                  PIC  X(01).                      
           03  CAD-CPFNC               PIC  9(11)    COMP-3.            
           03  CAD-LOCAL               PIC  XX.                         
           03  CAD-LOCA2               PIC  X.                          
           03  CAD-SUBSTAB             PIC  X.                          
           03  CAD-CDULT               PIC  9(03)    COMP-3.            
           03  CAD-DTULT               PIC  9(09)    COMP-3.            
           03  CAD-OCORRENCIAS.                                         
               05  CAD-OCORR           PIC  9(03)    COMP-3 OCCURS 50.  
           03  CAD-MARCA               PIC  X.                          
           03  CAD-IDCON               PIC  X.                          
           03  CAD-CARTA               PIC  X.                          
      *-  CAD-CARTA (POS. 576) = 'Z' >  SECURITIZADA SAFIRA             
           03  CAD-TXPUN               PIC  X.                          
           03  CAD-AJUP                PIC  X.                          
           03  CAD-REGBX               PIC  X.                          
           03  CAD-CRITTR              PIC  X(02).                      
           03  CAD-REGNOVO             PIC  X(01).                      
           03  CAD-TPBXCBR             PIC  X(01).                      
           03  CAD-FALCON              PIC  X(01).                      
           03  CAD-EMISSAO             PIC  X(01).                      
           03  CAD-MARCA-180           PIC  X.                          
           03  CAD-DATA-MARCA-180      PIC  9(09)    COMP-3.            
           03  CAD-ORIGEM              PIC  9(02).                      
           03  CAD-TPEXP               PIC  X(01).                      
           03  CAD-NAT-OPER            PIC  9(03)    COMP-3.            
           03  CAD-IDENT               PIC  X(02).                      
           03  CAD-TIPBX               PIC  X.                          
           03  CAD-TIPO                PIC  9.                          
           03  CAD-RAZAO-LP            PIC  9(05)    COMP-3.            
           03  CAD-CONTA-LP            PIC  9(07)    COMP-3.            
      /                                                                 
      *---------------------------------------------------------------* 
      *           AREA PARA ACESSAR A DATA E A HORA DO SISTEMA        * 
      *---------------------------------------------------------------* 
                                                                        
       01  FILLER.                                                      
                                                                        
                                                                        
           03  DATA-HORA.                                               
               05  DT-JULIANA          PIC 9(05)  COMP-3.               
               05  DT-AAMMDD           PIC 9(07)  COMP-3.               
               05  DT-AAAAMMDD         PIC 9(09)  COMP-3.               
               05  TI-HHMMSS           PIC 9(07)  COMP-3.               
               05  TI-HHMMSSMMMMMM     PIC 9(13)  COMP-3.               
               05  TIMESTAMP           PIC X(20).                       
                                                                        
           03  WRK-DATA-DATE.                                           
               05  WRK-SEC-DATE        PIC  9(002).                     
               05  WRK-ANO-DATE        PIC  9(002).                     
               05  WRK-MES-DATE        PIC  9(002).                     
               05  WRK-DIA-DATE        PIC  9(002).                     
           03  WRK-DATA-DATE-R REDEFINES WRK-DATA-DATE PIC 9(08).       
                                                                        
           03  WRK-DATA-SYS            PIC  9(008).                     
           03  WRK-DATA-SYS-R REDEFINES WRK-DATA-SYS.                   
               05  WRK-SEC-SYS         PIC  9(002).                     
               05  WRK-ANO-SYS         PIC  9(002).                     
               05  WRK-MES-SYS         PIC  9(002).                     
               05  WRK-DIA-SYS         PIC  9(002).                     
                                                                        
           03  WRK-HORA-SYS            PIC  9(008).                     
           03  WRK-HORA-SYS-R REDEFINES WRK-HORA-SYS.                   
               05  WRK-HH-SYS          PIC  9(002).                     
               05  WRK-MM-SYS          PIC  9(002).                     
               05  WRK-SS-SYS          PIC  9(002).                     
               05  FILLER              PIC  X(002).                     
                                                                        
      /---------------------------------------------------------------* 
      *                 AREA PARA FORMATACAO DE DATAS                 * 
      *---------------------------------------------------------------* 
                                                                        
      ****** AREA PARA RECEBER E QUEBRAR A DATA VECTO DO MOVCRED2       
                                                                        
           03  WRK-DATA-VECTO          PIC  9(008).                     
           03  WRK-DATA-VECTO-R REDEFINES WRK-DATA-VECTO.               
               05  WRK-ANO-VECTO       PIC  9(004).                     
               05  WRK-MES-VECTO       PIC  9(002).                     
               05  WRK-DIA-VECTO       PIC  9(002).                     
                                                                        
      ****** AREA PARA RECEBER E QUEBRAR A DATA MOVTO DO ARQDATAS       
                                                                        
           03  WRK-DATA-MOVTO          PIC  9(008).                     
           03  WRK-DATA-MOVTO-R REDEFINES WRK-DATA-MOVTO.               
               05  WRK-DIA-MOVTO       PIC  9(002).                     
               05  WRK-MES-MOVTO       PIC  9(002).                     
               05  WRK-ANO-MOVTO       PIC  9(004).                     
                                                                        
           03  WRK-DATA                PIC  9(008).                     
           03  WRK-DATA-R  REDEFINES   WRK-DATA.                        
               05  WRK-DIA             PIC  9(002).                     
               05  WRK-MES             PIC  9(002).                     
               05  WRK-ANO             PIC  9(004).                     
                                                                        
           03  WRK-DATA-AUX            PIC  9(008).                     
           03  WRK-DATA-AUX-R  REDEFINES   WRK-DATA-AUX.                
               05  WRK-DIA-AUX         PIC  9(002).                     
               05  WRK-MES-AUX         PIC  9(002).                     
               05  WRK-ANO-AUX         PIC  9(004).                     
                                                                        
           03  WRK-DATA-DMA            PIC  9(008).                     
           03  FILLER      REDEFINES   WRK-DATA-DMA.                    
               05  WRK-DIA-DMA         PIC  9(002).                     
               05  WRK-MES-DMA         PIC  9(002).                     
               05  WRK-ANO-DMA         PIC  9(004).                     
                                                                        
           03  WRK-DATA-DIA            PIC  9(008).                     
           03  FILLER      REDEFINES   WRK-DATA-DIA.                    
               05  WRK-ANO-DIA         PIC  9(004).                     
               05  WRK-MES-DIA         PIC  9(002).                     
               05  WRK-DIA-DIA         PIC  9(002).                     
                                                                        
           03  WRK-DATA-VCTO           PIC  9(008).                     
           03  FILLER      REDEFINES   WRK-DATA-VCTO.                   
               05  WRK-ANO-VCTO        PIC  9(004).                     
               05  WRK-MES-VCTO        PIC  9(002).                     
               05  WRK-DIA-VCTO        PIC  9(002).                     
                                                                        
           03  WRK-DATA-SAMD           PIC  9(008).                     
           03  FILLER      REDEFINES   WRK-DATA-SAMD.                   
               05  WRK-ANO-SAMD        PIC  9(004).                     
               05  WRK-MES-SAMD        PIC  9(002).                     
               05  WRK-DIA-SAMD        PIC  9(002).                     
                                                                        
           03  WRK-DATA-SAMD-ENTRCLLP  PIC  9(008).                     
           03  FILLER      REDEFINES   WRK-DATA-SAMD-ENTRCLLP.          
               05  WRK-ANO-SAMD-ENTRCLLP  PIC  9(004).                  
               05  WRK-MES-SAMD-ENTRCLLP  PIC  9(002).                  
               05  WRK-DIA-SAMD-ENTRCLLP  PIC  9(002).                  
                                                                        
      *---------------------------------------------------------------* 
      *              AREA PARA FORMATACAO DO NCL                      * 
      *---------------------------------------------------------------* 
                                                                        
           03  WRK-NCL                 PIC  9(015).                     
           03  WRK-NCL-R  REDEFINES  WRK-NCL.                           
               05  WRK-NCL-TESTE     PIC  9(002).                       
               05  WRK-NCL-1         PIC  9(013).                       
                                                                        
      *---------------------------------------------------------------* 
      *              AREA PARA FORMATACAO DO CAMPO RAZAO              * 
      *---------------------------------------------------------------* 
                                                                        
           03  WRK-RAZAO               PIC  9(004).                     
           03  WRK-RAZAO-R  REDEFINES  WRK-RAZAO.                       
               05  WRK-RAZAO-1         PIC  9(002).                     
               05  WRK-RAZAO-2         PIC  9(002).                     
                                                                        
STF   *---------------------------------------------------------------* 
STF   *              AREA PARA FORMATACAO DO CAMPO RAZAO-GRUPO        * 
STF   *---------------------------------------------------------------* 
                                                                        
STF    01  WRK-RAZAO-GRUPO             PIC  9(05).                      
STF    01  WRK-RAZAO-GRUPO-R REDEFINES WRK-RAZAO-GRUPO.                 
STF        03  WRK-RZ-GRUPO            PIC  9(02).                      
STF        03  WRK-RZ-SUBGRUPO         PIC  9(02).                      
STF        03  FILLER                  PIC  X(01).                      
                                                                        
      /---------------------------------------------------------------* 
      *               DEFINICAO DO RELATORIO - 'RELATO'               * 
      *---------------------------------------------------------------* 
                                                                        
      *  CABECALHO  *                                                   
      * ----------- *                                                   
                                                                        
       01  CABEC1-REL.                                                  
           03 FILLER               PIC X(11) VALUE ' *CLLP8780*'.       
           03 FILLER               PIC X(06) VALUE '201207'.            
           03 FILLER               PIC X(06) VALUE SPACES.              
           03 FILLER               PIC X(18) VALUE 'TABULACAO DA FITA '.
           03 FILLER               PIC X(13) VALUE '292       EM '.     
           03 CB1-DIA-REL          PIC 9(02).                           
           03 FILLER               PIC X(01) VALUE '/'.                 
           03 CB1-MES-REL          PIC 9(02).                           
           03 FILLER               PIC X(01) VALUE '/'.                 
           03 CB1-ANO-REL          PIC 9(04).                           
                                                                        
       01  CABEC2-REL.                                                  
           03 FILLER               PIC X(10) VALUE SPACES.              
           03 FILLER               PIC X(07) VALUE 'EMPRESA'.           
           03 FILLER               PIC X(11) VALUE SPACES.              
           03 FILLER               PIC X(04) VALUE 'QTDE'.              
           03 FILLER               PIC X(13) VALUE SPACES.              
           03 FILLER               PIC X(14) VALUE 'VAL.CTAB.LIQU.'.    
           03 FILLER               PIC X(07) VALUE SPACES.              
           03 FILLER               PIC X(20) VALUE                      
              'VR ENCARGOS VENCIDOS'.                                   
           03 FILLER               PIC X(13) VALUE SPACES.              
           03 FILLER               PIC X(14) VALUE 'VAL.CTAB.BRUTO'.    
           03 FILLER               PIC X(07) VALUE SPACES.              
           03 FILLER               PIC X(11) VALUE 'OBSERVACAO'.        
                                                                        
      *  LINHA DETALHE  *                                               
      * --------------- *                                               
                                                                        
       01  DET1.                                                        
           03 FILLER               PIC X(11) VALUE SPACES.              
           03 DET1-EMPR            PIC ZZZZZB(07).                      
           03 DET1-QTDE            PIC Z.ZZZ.ZZZB(07).                  
           03 DET1-VRTOT           PIC Z.ZZZ.ZZZ.ZZZ.ZZ9,99B(07).       
           03 DET1-VRENCVEN        PIC Z.ZZZ.ZZZ.ZZZ.ZZ9,99B(07).       
           03 DET1-VRCONT          PIC Z.ZZZ.ZZZ.ZZZ.ZZ9,99B(07).       
           03 DET1-OBS             PIC X(13).                           
                                                                        
       01  DETB.                                                        
           03 FILLER               PIC X(60) VALUE SPACES.              
                                                                        
      *  LINHA TOTAL  *                                                 
      * ------------- *                                                 
                                                                        
       01  TOTAL1-TIPO.                                                 
           03 FILLER               PIC X(01) VALUE SPACES.              
           03 FILLER               PIC X(20) VALUE                      
              'TOTAL '.                                                 
           03 FILLER               PIC X(02) VALUE SPACES.              
           03 TOT1-QTDE            PIC Z.ZZZ.ZZZB(07).                  
           03 TOT1-VRTOT           PIC Z.ZZZ.ZZZ.ZZZ.ZZ9,99B(07).       
           03 TOT1-VRENCVEN        PIC Z.ZZZ.ZZZ.ZZZ.ZZ9,99B(07).       
           03 TOT1-VRCONT          PIC Z.ZZZ.ZZZ.ZZZ.ZZ9,99B(07).       
                                                                        
       01  TOTAL2-EMPRESA.                                              
           03 FILLER               PIC X(01) VALUE SPACES.              
           03 FILLER               PIC X(20) VALUE                      
              'TOTAL EMPRESA'.                                          
           03 FILLER               PIC X(02) VALUE SPACES.              
           03 TOT2-QTDE            PIC Z.ZZZ.ZZZB(07).                  
           03 TOT2-VRTOT           PIC Z.ZZZ.ZZZ.ZZZ.ZZ9,99B(07).       
           03 TOT2-VRENCVEN        PIC Z.ZZZ.ZZZ.ZZZ.ZZ9,99B(07).       
           03 TOT2-VRCONT          PIC Z.ZZZ.ZZZ.ZZZ.ZZ9,99B(07).       
                                                                        
       01  TOTAL3-GERAL.                                                
           03 FILLER               PIC X(01) VALUE SPACES.              
           03 FILLER               PIC X(20) VALUE                      
              'TOTAL GERAL'.                                            
           03 FILLER               PIC X(02) VALUE SPACES.              
           03 TOT3-QTDE            PIC Z.ZZZ.ZZZB(07).                  
           03 TOT3-VRTOT           PIC Z.ZZZ.ZZZ.ZZZ.ZZ9,99B(07).       
           03 TOT3-VRENCVEN        PIC Z.ZZZ.ZZZ.ZZZ.ZZ9,99B(07).       
           03 TOT3-VRCONT          PIC Z.ZZZ.ZZZ.ZZZ.ZZ9,99B(07).       
                                                                        
      /---------------------------------------------------------------* 
      *               DEFINICAO DO RELATORIO - 'RELPEND'              * 
      *---------------------------------------------------------------* 
                                                                        
      *  CABECALHO  *                                                   
      * ----------- *                                                   
                                                                        
       01  CABEC1-PEND.                                                 
           03  FILLER                  PIC  X(001) VALUE '1'.           
           03  FILLER                  PIC  X(010) VALUE '*CLLP8780*'.  
           03  FILLER                  PIC  X(06)  VALUE '201207'.      
           03  FILLER                  PIC  X(003) VALUE SPACES.        
           03  CB1-DIA-PEND            PIC  9(002).                     
           03  FILLER                  PIC  X(001) VALUE '/'.           
           03  CB1-MES-PEND            PIC  9(002).                     
           03  FILLER                  PIC  X(001) VALUE '/'.           
           03  CB1-ANO-PEND            PIC  9(004).                     
           03  FILLER                  PIC  X(010) VALUE SPACES.        
           03  FILLER                  PIC  X(043) VALUE                
               'B A N C O        B R A D E S C O      S / A'.           
           03  FILLER                  PIC  X(020) VALUE                
               '        -           '.                                  
           03  CB1-HH                  PIC  9(002).                     
           03  FILLER                  PIC  X(001) VALUE ':'.           
           03  CB1-MM                  PIC  9(002).                     
           03  FILLER                  PIC  X(001) VALUE ':'.           
           03  CB1-SS                  PIC  9(002).                     
           03  FILLER                  PIC  X(006) VALUE SPACES.        
           03  FILLER                  PIC  X(006) VALUE 'PAG.  '.      
           03  CB1-PAG                 PIC  ZZ.ZZ9.                     
                                                                        
       01  CABEC2-PEND.                                                 
           03  FILLER                  PIC  X(001) VALUE '0'.           
           03  FILLER                  PIC  X(029) VALUE SPACES.        
           03  FILLER                  PIC  X(068) VALUE                
                'RELATORIO DAS PENDENCIAS EM MORA ENVIADAS A ROTINA RISC
      -         ' - DATA BASE '.                                        
           03  CB2-DIA-BASE            PIC  9(002).                     
           03  FILLER                  PIC  X(001) VALUE '/'.           
           03  CB2-MES-BASE            PIC  9(002).                     
           03  FILLER                  PIC  X(001) VALUE '/'.           
           03  CB2-ANO-BASE            PIC  9(004).                     
                                                                        
       01  CABEC3-PEND.                                                 
           03  FILLER                  PIC  X(001) VALUE '-'.           
           03  FILLER                  PIC  X(047) VALUE                
               'EMPR    JUNC  RAZAO   AGENC     CONTA/D  CART  '.       
           03  FILLER                  PIC  X(083) VALUE                
                '            CONTR/D  VENCTO  SIT PRAZO A/P NATJUR ATIVD
      -         ' GARANTIA        VALOR TOTAL'.                         
                                                                        
      *  LINHA DETALHE  *                                               
      * --------------- *                                               
                                                                        
       01  LINDET1.                                                     
           03  FILLER                  PIC  X(001) VALUE ' '.           
           03  LD1-EMPRESA             PIC  ZZZ9BB.                     
           03  LD1-EMPRESA-N REDEFINES LD1-EMPRESA                      
                                       PIC  9(004)BB.                   
           03  LD1-EMPRESA-X REDEFINES LD1-EMPRESA                      
                                       PIC  X(004)BB.                   
           03  LD1-JUNCAO              PIC  ZZ.ZZ9BB.                   
           03  LD1-JUNCAO-N  REDEFINES  LD1-JUNCAO                      
                                       PIC  9(006)BB.                   
           03  LD1-JUNCAO-X  REDEFINES  LD1-JUNCAO                      
                                       PIC  X(006)BB.                   
           03  LD1-RAZAO.                                               
               05  LD1-RAZAO-1         PIC  9(002).                     
               05  LD1-RZ-TRACO        PIC  X(001) VALUE SPACES.        
               05  LD1-RAZAO-2         PIC  9(002)BB.                   
           03  LD1-RAZAO-N   REDEFINES LD1-RAZAO                        
                                       PIC  9(005)BB.                   
           03  LD1-RAZAO-X   REDEFINES LD1-RAZAO                        
                                       PIC  X(005)BB.                   
           03  LD1-AGENCIA             PIC  ZZ.ZZ9BB.                   
           03  LD1-CONTA               PIC  ZZZZ.ZZ9.                   
           03  FILLER                  PIC  X(001) VALUE '/'.           
           03  LD1-DIG-CTA             PIC  X(001)BBB.                  
           03  LD1-CARTEIRA            PIC  X(003)BB.                   
           03  LD1-CONTRATO            PIC  ZZZZZZZZZZZZZZZZ9.          
           03  FILLER                  PIC  X(001) VALUE '/'.           
           03  LD1-DIG-CTR             PIC  X(001)B.                    
           03  LD1-DIA-VECTO           PIC  9(002).                     
           03  FILLER                  PIC  X(001) VALUE '/'.           
           03  LD1-MES-VECTO           PIC  9(002).                     
           03  FILLER                  PIC  X(001) VALUE '/'.           
           03  LD1-ANO-VECTO           PIC  9(004)B.                    
           03  LD1-SITUACAO            PIC  9(001)BBB.                  
           03  LD1-PRAZO               PIC  9(002)BBB.                  
           03  LD1-ATI-PAS             PIC  9(001)BBBB.                 
           03  LD1-NAT-JUR             PIC  9(002)BBBB.                 
           03  LD1-RAMO-ATIV           PIC  9(003)BBBBB.                
           03  LD1-GARANTIA            PIC  9(002)BBBBB.                
           03  LD1-VALOR               PIC  ZZ.ZZZ.ZZZ.ZZ9,99.          
                                                                        
      *  LINHA TOTAL  *                                                 
      * ------------- *                                                 
                                                                        
       01  LINTOT1.                                                     
           03  FILLER                  PIC  X(001) VALUE '0'.           
           03  FILLER                  PIC  X(010) VALUE SPACES.        
           03  FILLER                  PIC  X(029) VALUE                
               'TOTAL   G E R A L............'.                         
           03  FILLER                  PIC  X(073) VALUE SPACES.        
           03  LT1-TOTAL-GERAL         PIC  ZZZ.ZZZ.ZZZ.ZZ9,99B.        
                                                                        
       77  FILLER                  PIC  X(032) VALUE                    
           '**** FIM DA WORKING-STORAGE ****'.                          
           EJECT                                                        
JAPI-I*                                                                 
JAPI-I 77  CB-ON-OK                           PIC X(001)      VALUE 'N'.
JAPI-I 77  CB-ON-001                          PIC S9(09)         COMP   
JAPI-I                                                      VALUE ZEROS.
JAPI-I 77  CB-ON-002                          PIC S9(09)         COMP   
JAPI-I                                                      VALUE ZEROS.
      *********************                                             
       PROCEDURE DIVISION.                                              
      *********************                                             
                                                                        
      *DECLARATIVES.                                                    
      *COBOL-DEBUG SECTION.                                             
      *    USE FOR DEBUGGING ON ALL PROCEDURES.                         
      *COBOL-DEBUG-PARAGRAPH.                                           
      *    DISPLAY DEBUG-NAME.                                          
      *END DECLARATIVES.                                                
                                                                        
      *---------------------*                                           
       00000-INICIO SECTION.                                            
      *---------------------*                                           
                                                                        
JAPI-U     CALL  'BRAD7600'  USING  DATA-HORA.                          
           MOVE  DT-AAAAMMDD  TO  WRK-DATA-DATE-R.                      
                                                                        
           MOVE    WRK-SEC-DATE        TO                               
                                                   WRK-SEC-SYS.         
           MOVE    WRK-ANO-DATE        TO                               
                                                   WRK-ANO-SYS.         
           MOVE    WRK-MES-DATE        TO                               
                                                   WRK-MES-SYS.         
           MOVE    WRK-DIA-DATE        TO                               
                                                   WRK-DIA-SYS.         
                                                                        
           ACCEPT  WRK-HORA-SYS        FROM        TIME.                
                                                                        
           OPEN    INPUT     ARQDATA                                    
STF                OUTPUT    ARQ292    RELATO    RELPEND  SGARANTI.     
                                                                        
           SORT    ARQSORT   ASCENDING KEY         SRT-EMPRESA          
                                                   SRT-TIPO             
                                                   SRT-EXERCICIO        
                   INPUT     PROCEDURE 01000-SELECIONA                  
                   OUTPUT    PROCEDURE 60000-IMPRIME.                   
                                                                        
STF        CLOSE  ARQDATA ARQ292  RELATO RELPEND  SGARANTI.             
           STOP    RUN.                                                 
                                                                        
       00000-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *------------------------*                                        
       01000-SELECIONA SECTION.                                         
      *------------------------*                                        
                                                                        
           READ    ARQDATA             AT          END                  
                   DISPLAY '********** CLLP8780 *********' UPON CONSOLE 
                   DISPLAY '**   SR. OPERADOR:         **' UPON CONSOLE 
                   DISPLAY '**   O  ARQUIVO  ARQDATA   **' UPON CONSOLE 
                   DISPLAY '**   ENCONTRA-SE  VAZIO.   **' UPON CONSOLE 
                   DISPLAY '********** CLLP8780 *********' UPON CONSOLE 
                   CALL    'ILBOABN0'         USING    WRK-ABEND.       
                                                                        
           MOVE    DATA-DIA            TO          WRK-DATA             
           MOVE    WRK-DIA             TO          WRK-DIA-DIA          
                                                   CB1-DIA-REL          
           MOVE    WRK-MES             TO          WRK-MES-DIA          
                                                   CB1-MES-REL          
           MOVE    WRK-ANO             TO          WRK-ANO-DIA          
                                                   CB1-ANO-REL.         
                                                                        
           PERFORM 10000-LER-CADALPCL.                                  
           IF      RETURN-CODE         EQUAL       4                    
                   MOVE   'S'          TO          WRK-ARQVAZIO.        
                                                                        
           MOVE    CAD-CART2           TO          WRK-CARTEIRA-ANT.    
           MOVE    CAD-AG              TO          WRK-AGENCIA-ANT.     
                                                                        
           PERFORM 20000-GRAVAR        UNTIL       RETURN-CODE          
                                       EQUAL       4.                   
                                                                        
           PERFORM 50000-GRAVA-ARQSORT.                                 
           ADD     ACU-TOTAL-AGEN      TO          ACU-TOTAL-GERAL.     
                                                                        
           PERFORM 43000-IMPR-TOT-GERAL.                                
                                                                        
       01000-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *--------------------------*                                      
      /---------------------------*                                     
       10000-LER-CADALPCL SECTION.                                      
      *---------------------------*                                     
      *-------------------------------------------*                     
      *  LEITURA DO CADALPCL. (ARQ. COMPRIMIDO).  *                     
      *-------------------------------------------*                     
                                                                        
JAPI-U     CALL    'BRAD0300'          USING       WRK-CAD   WRK-REG.   
                                                                        
           IF       RETURN-CODE        EQUAL       4                    
                    MOVE    99999      TO          CAD-EMPRESA          
                    MOVE    99999      TO          CAD-AG               
                    GO  TO  10000-99-FIM.                               
                                                                        
           MOVE CAD-NUMCL TO WRK-NCL.                                   
                                                                        
JAPI-I     ADD 1 TO CB-ON-001                                           
JAPI-I     IF  CB-ON-001 = 1                                            
                    MOVE   CAD-EMPRESA TO          WRK-EMP-ANT.         
                                                                        
           IF  CAD-CTR  NOT NUMERIC                                     
               MOVE ZEROS   TO  CAD-NCGC                                
                                 CAD-FIL                                
                                 CAD-CTR.                               
           IF  CAD-CTR1 NOT NUMERIC                                     
               MOVE ZEROS   TO  CAD-NCGC1                               
                                 CAD-FIL1                               
                                 CAD-CTR1.                              
           IF  CAD-CTR2 NOT NUMERIC                                     
               MOVE ZEROS   TO  CAD-NCGC2                               
                                 CAD-FIL2                               
                                 CAD-CTR2.                              
                                                                        
           MOVE     CAD-DTWOFF     TO  WRK-DATA-DMA.                    
           MOVE     WRK-DIA-DMA    TO  WRK-DIA-SAMD-ENTRCLLP.           
           MOVE     WRK-MES-DMA    TO  WRK-MES-SAMD-ENTRCLLP.           
           MOVE     WRK-ANO-DMA    TO  WRK-ANO-SAMD-ENTRCLLP.           
                                                                        
           IF  CAD-TIPO  EQUAL  1  AND                                  
               CAD-EMPRESA     EQUAL  5240  AND                         
               WRK-DATA-SAMD-ENTRCLLP NOT LESS 20010801                 
                   COMPUTE  CAD-VRENCVEN = (CAD-VRENCVEN + CAD-VREVI).  
                                                                        
PIAZZA     IF  CAD-TIPO  EQUAL  1  AND                                  
PIAZZA         CAD-EMPRESA     EQUAL  7830  AND                         
PIAZZA         WRK-DATA-SAMD-ENTRCLLP NOT LESS 20010801                 
PIAZZA             COMPUTE  CAD-VRENCVEN = (CAD-VRENCVEN + CAD-VREVI).  
                                                                        
           IF  (CAD-TIPO EQUAL 1   AND                                  
      ***      CAD-MARCA-180  NOT EQUAL SPACES   AND                    
               CAD-VLR-RESG   LESS  CAD-VRENCVEN)                       
                            GO  TO  10000-LER-CADALPCL.                 
                                                                        
           IF  CAD-TIPO  EQUAL  1                                       
               COMPUTE  WRK-VR-LIQUIDO = (CAD-VLR-RESG - CAD-VRENCVEN)  
               MOVE     CAD-VRENCVEN   TO  WRK-VRENCVEN                 
           ELSE                                                         
               MOVE     CAD-VLR-RESG   TO  WRK-VR-LIQUIDO               
               MOVE     ZEROS          TO  WRK-VRENCVEN.                
                                                                        
                                                                        
           IF  CAD-TIPO  EQUAL  1  AND                                  
               CAD-MARCA-180    EQUAL  SPACES                           
               MOVE 'CL1'    TO  ID-292                                 
           ELSE                                                         
           IF  CAD-TIPO  EQUAL  1  AND                                  
               CAD-MARCA-180    EQUAL  'N'                              
               MOVE 'CL3'    TO  ID-292                                 
           ELSE                                                         
               MOVE 'CL2'    TO  ID-292.                                
                                                                        
           MOVE     CAD-VCTO           TO          WRK-DATA-DMA         
           MOVE     WRK-DIA-DMA        TO          WRK-DIA-SAMD         
           MOVE     WRK-MES-DMA        TO          WRK-MES-SAMD         
           MOVE     WRK-ANO-DMA        TO          WRK-ANO-SAMD         
                                                                        
           IF   (( CAD-EMPRESA EQUAL 4120 OR 4025 OR 4900 OR 7000 )     
                OR                                                      
                 ( CAD-EMPRESA         EQUAL       6000                 
                   AND                                                  
                   CAD-CART2 NOT EQUAL 502 )                            
                OR                                                      
PIAZZA           ( CAD-EMPRESA         EQUAL       5240 OR 7830)        
                   AND                                                  
                  (WRK-DATA-SAMD-ENTRCLLP NOT LESS 20000901)            
                OR                                                      
                 ( CAD-EMPRESA         EQUAL       5240 OR 7830)        
                   AND                                                  
PIAZZA            (WRK-DATA-SAMD       NOT GREATER WRK-DATA-DIA ))      
            IF    CAD-VLR-RESG         NOT EQUAL   ZEROS                
             IF   CAD-TIPO             EQUAL       1 OR 7               
                  IF  ( CAD-EMPRESA = 4900 AND CAD-TIPO = 7 )           
                  OR                                                    
                      ( CAD-EMPRESA = 4900 AND CAD-TIPO = 1 AND         
                      ( CAD-MARCA-180 = 'A' OR 'B' OR 'C' OR 'R' OR     
                                        'P' OR 'Q' OR 'N'))             
                      MOVE 4120 TO CAD-EMPRESA                          
                      GO   TO  10000-99-FIM                             
                  ELSE                                                  
                  IF  ( CAD-EMPRESA = 6000 AND                          
                        CAD-EMISSAO NOT EQUAL 'K' AND                   
                        CAD-EMISSAO NOT EQUAL 'J') OR                   
                      (CAD-EMPRESA = 8000)                              
                      MOVE 4120 TO CAD-EMPRESA                          
      ****************MOVE 28370 TO CAD-RAZAO-LP                        
                      GO  TO  10000-99-FIM                              
                  ELSE                                                  
                      GO   TO  10000-99-FIM                             
             ELSE                                                       
                  NEXT    SENTENCE                                      
            ELSE                                                        
                  NEXT    SENTENCE.                                     
                                                                        
           GO  TO  10000-LER-CADALPCL.                                  
                                                                        
       10000-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      /---------------------*                                           
       20000-GRAVAR SECTION.                                            
      *---------------------*                                           
                                                                        
                                                                        
           IF    ( CAD-MARCA-180       EQUAL       'P' OR 'Q' OR        
                                                   'N' OR 'R') OR       
                 ( CAD-TIPO            EQUAL       7 )         OR       
                 ( CAD-EMPRESA         EQUAL       6000   AND           
                   CAD-EMISSAO         NOT EQUAL   'K'    AND           
                   CAD-CART2           EQUAL       502)                 
                   MOVE    ZEROS       TO          CAD-VRENCVEN.        
                                                                        
           IF      CAD-EMPRESA         EQUAL       WRK-EMP-ANT          
                   PERFORM 30000-MONTA-REG                              
STF                PERFORM 20100-TRATA-SGARANTI                         
                   PERFORM 40000-VER-QUEBRA                             
                   PERFORM 10000-LER-CADALPCL                           
           ELSE                                                         
                   PERFORM 50000-GRAVA-ARQSORT                          
                   MOVE    CAD-EMPRESA TO          WRK-EMP-ANT.         
                                                                        
       20000-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
STF   *---------------------------------*                               
STF    20100-TRATA-SGARANTI      SECTION.                               
STF   *---------------------------------*                               
                                                                        
STF        IF  CAD-NCGC1  NOT  EQUAL       ZEROS                        
STF            PERFORM  21000-TRATA-PRI-AVALISTA                        
STF            IF  CAD-NCGC2   NOT   EQUAL ZEROS                        
STF                PERFORM  21200-TRATA-SEG-AVALISTA.                   
                                                                        
STF    20100-99-FIM. EXIT.                                              
STF   *-------------------*                                             
                                                                        
STF   *---------------------------------*                               
STF    21000-TRATA-PRI-AVALISTA  SECTION.                               
STF   *---------------------------------*                               
                                                                        
STF        IF  CAD-FIL1    EQUAL       ZEROS                            
STF            MOVE   1       TO       GAR-TIPO-GARANTIDOR              
STF        ELSE                                                         
               MOVE   2       TO       GAR-TIPO-GARANTIDOR.             
                                                                        
STF        MOVE  ZEROS        TO       GAR-DT-ULTIMA-AVALIACAO          
STF        MOVE  CAD-NCGC1    TO       GAR-NUMERO-COOBRIGADO            
STF        MOVE  CAD-FIL1     TO       GAR-FILIAL-COOBRIGADO            
STF        MOVE  CAD-CTR1     TO       GAR-CONTR-COOBRIGADO             
STF        MOVE  'LPCL'       TO       GAR-CENTRO-CUSTO                 
STF        MOVE  CAD-AG       TO       GAR-AGENCIA                      
STF        MOVE  CAD-CONTA    TO       GAR-CONTA                        
STF        MOVE  CAD-CART2    TO       GAR-CARTEIRA                     
STF        MOVE  CAD-CONTR    TO       GAR-CONTRATO                     
STF        MOVE  CAD-EMPRESA  TO       GAR-EMPRESA                      
STF        MOVE  ZEROS        TO       GAR-VALOR-GARANTIA               
STF                                    GAR-TIPO-GARANTIA                
STF        WRITE REG-GARANTIA.                                          
                                                                        
STF    21000-99-FIM. EXIT.                                              
STF   *-------------------*                                             
                                                                        
STF   *---------------------------------*                               
STF    21200-TRATA-SEG-AVALISTA  SECTION.                               
STF   *---------------------------------*                               
                                                                        
STF        IF  CAD-FIL2    EQUAL       ZEROS                            
STF            MOVE   1       TO       GAR-TIPO-GARANTIDOR              
STF        ELSE                                                         
               MOVE   2       TO       GAR-TIPO-GARANTIDOR.             
                                                                        
STF        MOVE  ZEROS        TO       GAR-DT-ULTIMA-AVALIACAO          
STF        MOVE  CAD-NCGC2    TO       GAR-NUMERO-COOBRIGADO            
STF        MOVE  CAD-FIL2     TO       GAR-FILIAL-COOBRIGADO            
STF        MOVE  CAD-CTR2     TO       GAR-CONTR-COOBRIGADO             
STF        MOVE  'LPCL'       TO       GAR-CENTRO-CUSTO                 
STF        MOVE  CAD-AG       TO       GAR-AGENCIA                      
STF        MOVE  CAD-CONTA    TO       GAR-CONTA                        
STF        MOVE  CAD-CART2    TO       GAR-CARTEIRA                     
STF        MOVE  CAD-CONTR    TO       GAR-CONTRATO                     
STF        MOVE  CAD-EMPRESA  TO       GAR-EMPRESA                      
STF        MOVE  ZEROS        TO       GAR-VALOR-GARANTIA               
STF                                    GAR-TIPO-GARANTIA                
STF        WRITE REG-GARANTIA.                                          
                                                                        
STF    21200-99-FIM. EXIT.                                              
STF   *-------------------*                                             
      *------------------------*                                        
       30000-MONTA-REG SECTION.                                         
      *------------------------*                                        
                                                                        
                   MOVE CAD-DTWOFF     TO          WRK-DATA-DMA         
                   MOVE WRK-DIA-DMA    TO          WRK-DIA-SAMD         
                   MOVE WRK-MES-DMA    TO          WRK-MES-SAMD         
                   MOVE WRK-ANO-DMA    TO          WRK-ANO-SAMD         
                   MOVE WRK-DATA-SAMD  TO          WRK-DATA-WRITEOFF.   
                                                                        
           IF    ( CAD-TIPO            EQUAL       7   )       OR       
                 ( CAD-MARCA-180       EQUAL   'P' OR 'Q' OR 'N' )      
                   PERFORM 31000-MONTA-REG-PREJUIZO                     
                   GO  TO  30000-99-FIM.                                
                                                                        
           IF      CAD-EMPRESA   EQUAL   4120 OR 4025 OR 4900 OR        
                                         6000 OR 7000                   
                   MOVE  0237          TO          EMPRESA-292          
STF                                                LD1-EMPRESA          
           ELSE                                                         
JH0404     IF      CAD-EMPRESA   EQUAL 5240                             
JH0404             MOVE  7036          TO          EMPRESA-292          
JH0404                                             LD1-EMPRESA          
JH0404     ELSE                                                         
                   MOVE  CAD-EMPRESA   TO          EMPRESA-292          
STF                                                LD1-EMPRESA.         
                                                                        
           IF  CAD-EMPRESA          EQUAL  7000                         
               IF CAD-EMISSAO       EQUAL  'F'                          
                   MOVE  7400       TO   EMPRESA-292                    
                                         LD1-EMPRESA                    
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  ' '                          
CPM   **************OVE  7881       TO   EMPRESA-292                    
BERJ               MOVE  7356       TO   EMPRESA-292                    
                                         LD1-EMPRESA                    
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'B'                          
                   MOVE  7830       TO   EMPRESA-292                    
                                         LD1-EMPRESA                    
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'D'                          
      **************OVE  7881       TO   EMPRESA-292                    
BERJ               MOVE  7356       TO   EMPRESA-292                    
                                         LD1-EMPRESA                    
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'C' OR                       
                  CAD-CARTA         EQUAL  'B'                          
                   MOVE  5455       TO   EMPRESA-292                    
                                         LD1-EMPRESA                    
                                                                        
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'Q'                          
                   MOVE  7290       TO   EMPRESA-292                    
                                                                        
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'Z'                          
                   MOVE  8263       TO   EMPRESA-292                    
                                         LD1-EMPRESA                    
                                                                        
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'X'                          
                   MOVE  5201       TO   EMPRESA-292                    
                                         LD1-EMPRESA                    
                                                                        
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'R'                          
                   MOVE  5177       TO   EMPRESA-292                    
                                         LD1-EMPRESA                    
                                                                        
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'M'                          
                   MOVE  9242       TO   EMPRESA-292                    
                                         LD1-EMPRESA                    
                                                                        
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'W'                          
CPM                MOVE  8100       TO   EMPRESA-292                    
                                         LD1-EMPRESA                    
                                                                        
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'V'                          
                   MOVE  7277       TO   EMPRESA-292                    
                                         LD1-EMPRESA.                   
                                                                        
           IF  CAD-EMPRESA   EQUAL  6000    AND                         
               CAD-EMISSAO   NOT EQUAL  'J' AND                         
               CAD-NAT-OPER  EQUAL  50                                  
               MOVE  7025  TO   EMPRESA-292 LD1-EMPRESA.                
                                                                        
           IF  CAD-EMPRESA   EQUAL  6000  AND                           
               CAD-EMISSAO   NOT EQUAL  'J' AND                         
               CAD-CART2      EQUAL   658                               
                        MOVE  7036  TO   EMPRESA-292                    
                                         LD1-EMPRESA.                   
                                                                        
           IF  CAD-EMPRESA   EQUAL  6000  AND                           
               CAD-EMISSAO   EQUAL  'J'                                 
                        MOVE  7400  TO   EMPRESA-292                    
                                         LD1-EMPRESA.                   
                                                                        
           IF  CAD-CARTA     EQUAL  'Z' OR 'A'                          
                        MOVE  8267  TO   EMPRESA-292                    
                                         LD1-EMPRESA.                   
PIAZZA     IF     (CAD-EMPRESA         EQUAL 7000) AND                  
PIAZZA            (CAD-CART            EQUAL 288)                       
PIAZZA                  MOVE  5201  TO   EMPRESA-292                    
PIAZZA                                   LD1-EMPRESA                    
PIAZZA     END-IF.                                                      
                                                                        
           MOVE    CAD-AG              TO          AGENC-292            
                                                   LD1-AGENCIA.         
                                                                        
STF        MOVE    07050               TO          WRK-RAZAO-GRUPO.     
STF        MOVE    WRK-RZ-GRUPO        TO          GRUPO-CC-292.        
STF        MOVE    WRK-RZ-SUBGRUPO     TO          SUBGRUPO-CC-292.     
                                                                        
           IF      CAD-CONTA           EQUAL       0                    
                   MOVE  1             TO          CONTA-292            
                                                   LD1-CONTA            
           ELSE                                                         
                   MOVE  CAD-CONTA     TO          CONTA-292            
                                                   LD1-CONTA.           
                                                                        
           MOVE    ZERO                TO          LD1-DIG-CTA.         
                                                                        
           PERFORM 33000-VER-PRAZOS.                                    
                                                                        
           MOVE    WRK-PRAZO           TO          PRAZO-292            
                                                   LD1-PRAZO.           
           MOVE    WRK-DATA-VCTO       TO          DT-MENOR-VENCTO-292  
                                                   DT-MAIOR-VENCTO-292  
                                                                        
           MOVE    CAD-VCTO            TO          WRK-DATA-DMA         
           MOVE    WRK-DIA-DMA         TO          WRK-DIA-SAMD         
           MOVE    WRK-MES-DMA         TO          WRK-MES-SAMD         
           MOVE    WRK-ANO-DMA         TO          WRK-ANO-SAMD         
                                                                        
           IF      WRK-DATA-SAMD       NOT GREATER WRK-DATA-DIA         
                   MOVE    2           TO          SITUACAO-292         
                                                   LD1-SITUACAO         
           ELSE                                                         
                   MOVE    1           TO          SITUACAO-292         
                                                   LD1-SITUACAO.        
                                                                        
           MOVE    WRK-DIA-DMA         TO          LD1-DIA-VECTO        
           MOVE    WRK-MES-DMA         TO          LD1-MES-VECTO        
           MOVE    WRK-ANO-DMA         TO          LD1-ANO-VECTO.       
                                                                        
           MOVE    CAD-CART2           TO          CARTEIRA-292         
                                                   LD1-CARTEIRA.        
           IF      CAD-CONTR         EQUAL         ZEROS                
             MOVE    CAD-NUMCL         TO          CONTRATO-292         
                                                   LD1-CONTRATO         
           ELSE                                                         
             MOVE    CAD-CONTR         TO          CONTRATO-292         
                                                   LD1-CONTRATO.        
           MOVE    ZERO                TO          LD1-DIG-CTR.         
           MOVE    1                   TO          FIXO-292             
                                                   LD1-ATI-PAS.         
           MOVE    CAD-VLR-RESG        TO          VALOR-292            
                                                   WRK-VALOR.           
                                                                        
           ADD     1                   TO          ACU-QTDE-CL          
           ADD     CAD-VLR-RESG        TO          ACU-VLR-CON-CL.      
                                                                        
                                                                        
           MOVE    WRK-MES-DIA         TO          MES-292.             
           MOVE    WRK-ANO-DIA         TO          ANO-292.             
           MOVE    'LPCL'              TO          LPCL-292.            
                                                                        
           MOVE    CAD-EMPRESA         TO          AGENC-C-292          
                                                   LD1-JUNCAO.          
           IF   CAD-EMPRESA   EQUAL  6000                               
                    MOVE   4132    TO      AGENC-C-292                  
                                           LD1-JUNCAO.                  
                                                                        
           IF   CAD-EMPRESA   EQUAL  6000  AND                          
                CAD-CART2      EQUAL   502  AND                         
                CAD-EMISSAO    NOT EQUAL 'J'                            
                    MOVE   4135    TO      AGENC-C-292                  
                                           LD1-JUNCAO.                  
                                                                        
           IF   CAD-EMPRESA   EQUAL  6000  AND                          
                CAD-CART2     EQUAL   658  AND                          
                CAD-EMISSAO   NOT EQUAL 'J'                             
                    MOVE   8276    TO      AGENC-C-292                  
                                           LD1-JUNCAO.                  
                                                                        
           IF   CAD-EMPRESA   EQUAL  6000  AND                          
                CAD-EMISSAO   EQUAL  'J'                                
                    MOVE 7418 TO           AGENC-C-292                  
                                           LD1-JUNCAO.                  
                                                                        
           IF  CAD-EMPRESA          EQUAL  7000                         
               IF CAD-EMISSAO       EQUAL  ' '                          
CPM   **************OVE  5751       TO   AGENC-C-292                    
BERJ               MOVE  7370       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'F'                          
                   MOVE  7418       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'B'                          
                   MOVE  7838       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'D'                          
CPM   **************OVE  5751       TO   AGENC-C-292                    
BERJ               MOVE  7370       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'C' OR                       
                  CAD-CARTA         EQUAL  'B'                          
                   MOVE  5455       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'Q'                          
                   MOVE  7290       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'Z'                          
                   MOVE  8263       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'M'                          
                   MOVE  9787       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'X'                          
                   MOVE  9809       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'R'                          
                   MOVE  5177       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'W'                          
CPM   **************OVE  5751       TO   AGENC-C-292                    
BERJ               MOVE  7370       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'V'                          
                   MOVE  7085       TO   AGENC-C-292                    
                                         LD1-JUNCAO.                    
                                                                        
                                                                        
      *    IF  CAD-EMPRESA EQUAL  7000                                  
      *        IF  CAD-AG  EQUAL 7141  OR                               
      *            CAD-AG  EQUAL 7142  OR                               
      *            (CAD-AG >  3500  AND  CAD-AG  < 3600)                
      *                 MOVE  7142  TO   AGENC-C-292                    
      *                                  LD1-JUNCAO.                    
                                                                        
           IF  CAD-EMPRESA   EQUAL  6000  AND                           
               CAD-EMISSAO   NOT EQUAL 'J' AND                          
               CAD-NAT-OPER  EQUAL 50                                   
                        MOVE  7025  TO   AGENC-C-292                    
                                         LD1-JUNCAO.                    
                                                                        
           IF   CAD-CARTA     EQUAL  'Z' OR 'A'                         
                    MOVE 8267 TO           AGENC-C-292                  
                                           LD1-JUNCAO                   
           ELSE                                                         
           IF   CAD-CARTA     EQUAL  'B'                                
                    MOVE 5455 TO           AGENC-C-292                  
                                           LD1-JUNCAO.                  
                                                                        
PIAZZA     IF     (CAD-EMPRESA         EQUAL 7000) AND                  
PIAZZA            (CAD-CART            EQUAL 288)                       
PIAZZA                  MOVE  9803  TO   AGENC-C-292                    
PIAZZA                                   LD1-JUNCAO                     
PIAZZA     END-IF.                                                      
                                                                        
                                                                        
           IF CAD-CARTA   EQUAL    'Z' OR 'A'                           
              MOVE    006              TO          GRUPO-CONTAB-292     
                                                   LD1-RAZAO-1          
              MOVE    019              TO          SUBGRUPO-CONTAB-292  
                                                   LD1-RAZAO-2          
              MOVE    '-'              TO          LD1-RZ-TRACO         
           ELSE                                                         
           IF CAD-CART2    EQUAL   502 AND CAD-EMPRESA EQUAL 6000       
STF           MOVE   78010             TO          WRK-RAZAO-GRUPO      
STF           MOVE   WRK-RZ-GRUPO      TO          GRUPO-CONTAB-292     
STF           MOVE   WRK-RZ-GRUPO      TO          LD1-RAZAO-1          
STF           MOVE   WRK-RZ-SUBGRUPO   TO          SUBGRUPO-CONTAB-292  
STF           MOVE   WRK-RZ-SUBGRUPO   TO          LD1-RAZAO-2          
STF           MOVE   '-'               TO          LD1-RZ-TRACO         
           ELSE                                                         
STF            MOVE    '-'             TO          LD1-RZ-TRACO         
STF            MOVE    CAD-RZENTCL     TO          WRK-RAZAO-GRUPO      
STF            MOVE    WRK-RZ-GRUPO    TO          GRUPO-CONTAB-292     
STF            MOVE    WRK-RZ-GRUPO    TO          LD1-RAZAO-1          
STF            MOVE    WRK-RZ-SUBGRUPO TO          LD1-RAZAO-2          
STF            MOVE    WRK-RZ-SUBGRUPO TO          SUBGRUPO-CONTAB-292. 
           IF CAD-EMISSAO       EQUAL  'C' OR                           
              CAD-CARTA         EQUAL  'B'                              
                                                                        
      ***ALTERACAO luis                                                 
      * E  NCL COMEÇAR COM 87 E CARTEIRA FOR IGUAL A 855 OU 857         
      *     MOVE  017                TO          SUBGRUPO-CONTAB-292    
                                                                        
              IF WRK-NCL-TESTE EQUAL 87 AND                             
                 (CAD-CART EQUAL 855 OR CAD-CART EQUAL 857)             
                      MOVE    017      TO          SUBGRUPO-CONTAB-292  
                                                   LD1-RAZAO-2          
                  ELSE                                                  
                      MOVE    025      TO          SUBGRUPO-CONTAB-292  
                                                   LD1-RAZAO-2          
              END-IF                                                    
                                                                        
              MOVE    006              TO          GRUPO-CONTAB-292     
                                                   LD1-RAZAO-1          
              MOVE    '-'              TO          LD1-RZ-TRACO.        
                                                                        
           MOVE    CAD-TPGAR           TO          GARANTIA-292         
                                                   LD1-GARANTIA.        
                                                                        
           IF      GARANTIA-292        EQUAL       98  OR  99           
                   COMPUTE GARANTIA-292  =  ( GARANTIA-292 - 10 )       
                   MOVE    GARANTIA-292  TO        LD1-GARANTIA         
           ELSE                                                         
            IF     GARANTIA-292        EQUAL       ZEROS                
                   MOVE    22          TO          GARANTIA-292         
                                                   LD1-GARANTIA.        
            MOVE    CAD-NCGC           TO          NRO-CGC-292.         
            MOVE    CAD-FIL            TO          FIL-CGC-292.         
            MOVE    CAD-CTR            TO          CTR-CGC-292.         
                                                                        
           IF    ( CAD-EMPRESA         EQUAL       4900        AND      
                   CAD-NCGC            NOT EQUAL   ZEROS )              
STF                MOVE    ZEROS       TO          GRUPO-CC-292         
STF                                                SUBGRUPO-CC-292      
                                                   CONTA-292.           
                                                                        
STF        MOVE    SPACES              TO          NOME-292             
STF                                                RESERVA-292.         
                                                                        
           MOVE '99'                   TO          CLASS-OPER-292       
           MOVE  CAD-DTIOP             TO          WRK-DATA-AUX.        
           COMPUTE DT-INIC-OPER-292    =  (WRK-ANO-AUX * 10000 +        
                                           WRK-MES-AUX * 100   +        
                                           WRK-DIA-AUX).                
           MOVE  ZEROS                 TO          NRO-CGC-COOBR-292    
                                                   FIL-CGC-COOBR-292    
                                                   CTR-CGC-COOBR-292    
                                                                        
           MOVE  CAD-DATA              TO          WRK-DATA-AUX.        
                                                                        
STF        IF    CAD-FIL      NOT      EQUAL       ZEROS                
STF              MOVE         2        TO          TIPO-CLIENTE-292     
STF        ELSE                                                         
STF          IF  CAD-NCGC              EQUAL       ZEROS                
STF              MOVE         7        TO          TIPO-CLIENTE-292     
STF          ELSE                                                       
STF            IF  CAD-FIL             EQUAL       ZEROS                
STF                MOVE       1        TO          TIPO-CLIENTE-292.    
                                                                        
STF        IF  CAD-CARTA    EQUAL  'Z' OR 'A'                           
               MOVE  20           TO       NATUREZA-OPERACAO-292        
           ELSE                                                         
      * ALTERA LUIS                                                     
STF        IF  CAD-EMISSAO  EQUAL  'C' OR                               
STF            CAD-CARTA    EQUAL  'B'                                  
                                                                        
      *  E NCL COMEÇAR COM 87 E CARTEIRA FOR IGUAL A 855 OU 857         
      *   MOVE  2                TO         NATUREZA-OPERACAO-292       
                                                                        
              IF WRK-NCL-TESTE EQUAL 87 AND                             
                 (CAD-CART EQUAL 855 OR CAD-CART EQUAL 857)             
                   MOVE   2           TO      NATUREZA-OPERACAO-292     
              ELSE                                                      
STF                MOVE  12           TO      NATUREZA-OPERACAO-292     
              END-IF                                                    
STF        ELSE                                                         
STF            MOVE  1            TO       NATUREZA-OPERACAO-292        
           END-IF.                                                      
STF****        MOVE  1            TO       NATUREZA-OPERACAO-292.       
                                                                        
           IF      CAD-EMPRESA   EQUAL   7830                           
                   MOVE  7841          TO          AGENC-C-292          
                                                   LD1-JUNCAO           
           END-IF.                                                      
                                                                        
STF        MOVE  0199         TO       ORIGEM-RECURSO-292.              
STF        MOVE  21           TO       TAXA-REFERENCIAL-292.            
STF        MOVE  ZEROS        TO       VARIACAO-CAMBIAL-292.            
STF        MOVE  0012,0000000 TO       TAXA-EFETIVA-ANUAL-292.          
                                                                        
STF        IF    CAD-CDULT    EQUAL    004  OR                          
STF              CAD-CDULT    EQUAL    009  OR                          
STF              CAD-CDULT    EQUAL    054  OR                          
STF              CAD-CDULT    EQUAL    055  OR                          
STF              CAD-CDULT    GREATER  099                              
STF              MOVE         09       TO   CARAC-ESPECIAL-292          
STF        ELSE                                                         
STF              MOVE         ZEROS    TO   CARAC-ESPECIAL-292.         
                                                                        
STF        MOVE    ZEROS               TO   EXCLUSIVO-USGAAP-292        
STF                                         PRODUTO-292                 
STF                                         FAMILIA-292.                
                                                                        
           MOVE    REG-292             TO          WRK-REG-AUX.         
           WRITE   REG-292.                                             
                                                                        
           IF      CAD-VRENCVEN        GREATER     ZEROS                
                   PERFORM 32000-GRAVA-OUTRO-REGISTRO.                  
                                                                        
       30000-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *---------------------------------*                               
       31000-MONTA-REG-PREJUIZO SECTION.                                
      *---------------------------------*                               
      *    DISPLAY '*    PONTO 1     *'.                                
           IF      CAD-EMPRESA    EQUAL   4120 OR 4025 OR 4900 OR       
                                          6000                          
                   MOVE  0237          TO          EMPRESA-292          
STF                                                LD1-EMPRESA          
           ELSE                                                         
JH0404     IF      CAD-EMPRESA   EQUAL 5240                             
JH0404             MOVE  7036          TO          EMPRESA-292          
JH0404                                             LD1-EMPRESA          
JH0404     ELSE                                                         
                   MOVE  CAD-EMPRESA   TO          EMPRESA-292          
STF                                                LD1-EMPRESA.         
                                                                        
                                                                        
           IF  CAD-EMPRESA          EQUAL  7000                         
               IF CAD-EMISSAO       EQUAL  ' '                          
CPM   **************OVE  7881       TO   EMPRESA-292                    
BERJ               MOVE  7356       TO   EMPRESA-292                    
                                         LD1-EMPRESA                    
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'F'                          
                   MOVE  7400       TO   EMPRESA-292                    
                                         LD1-EMPRESA                    
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'B'                          
                   MOVE  7830       TO   EMPRESA-292                    
                                         LD1-EMPRESA                    
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'D'                          
      **************OVE  7881       TO   EMPRESA-292                    
BERJ               MOVE  7356       TO   EMPRESA-292                    
                                         LD1-EMPRESA                    
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'C' OR                       
                  CAD-CARTA         EQUAL  'B'                          
                   MOVE  5455       TO   EMPRESA-292                    
                                         LD1-EMPRESA                    
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'Q'                          
                   MOVE  7290       TO   EMPRESA-292                    
                                         LD1-EMPRESA                    
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'Z'                          
                   MOVE  8263       TO   EMPRESA-292                    
                                         LD1-EMPRESA                    
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'M'                          
                   MOVE  9242       TO   EMPRESA-292                    
                                         LD1-EMPRESA                    
                                         LD1-EMPRESA                    
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'X'                          
                   MOVE  5201       TO   EMPRESA-292                    
                                         LD1-EMPRESA                    
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'R'                          
                   MOVE  5177       TO   EMPRESA-292                    
                                         LD1-EMPRESA                    
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'W'                          
CPM   **************OVE  7881       TO   EMPRESA-292                    
BERJ               MOVE  7356       TO   EMPRESA-292                    
                                         LD1-EMPRESA                    
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'V'                          
                   MOVE  7277       TO   EMPRESA-292                    
                                         LD1-EMPRESA.                   
                                                                        
      *    DISPLAY '*    PONTO 2     *'.                                
                                                                        
           IF  CAD-EMPRESA   EQUAL  6000  AND                           
               CAD-NAT-OPER  EQUAL  50                                  
                        MOVE  7025  TO   EMPRESA-292                    
                                         LD1-EMPRESA.                   
                                                                        
           IF  CAD-EMPRESA   EQUAL  6000  AND                           
               CAD-EMISSAO    NOT EQUAL  'J' AND                        
               CAD-CART2      EQUAL   658                               
                        MOVE  7036  TO   EMPRESA-292                    
                                         LD1-EMPRESA.                   
                                                                        
           IF  CAD-EMPRESA   EQUAL  6000  AND                           
               CAD-EMISSAO   EQUAL  'J'                                 
                        MOVE  7400  TO   EMPRESA-292                    
                                         LD1-EMPRESA.                   
                                                                        
           IF  CAD-CARTA     EQUAL  'Z' OR 'A'                          
                        MOVE  8267  TO   EMPRESA-292                    
                                         LD1-EMPRESA                    
           ELSE                                                         
           IF  CAD-CARTA     EQUAL  'B'                                 
                        MOVE  5455  TO   EMPRESA-292                    
                                         LD1-EMPRESA.                   
                                                                        
PIAZZA     IF     (CAD-EMPRESA         EQUAL 7000) AND                  
PIAZZA            (CAD-CART            EQUAL 288)                       
PIAZZA                  MOVE  5201  TO   EMPRESA-292                    
PIAZZA                                   LD1-EMPRESA                    
PIAZZA     END-IF.                                                      
      *    DISPLAY '*    PONTO 3     *'.                                
                                                                        
      *    DISPLAY '*    PONTO 4     *'.                                
                                                                        
           MOVE    CAD-AG              TO          AGENC-292            
                                                   LD1-AGENCIA.         
                                                                        
STF        MOVE    07050               TO          WRK-RAZAO-GRUPO.     
STF        MOVE    WRK-RZ-GRUPO        TO          GRUPO-CC-292.        
STF        MOVE    WRK-RZ-SUBGRUPO     TO          SUBGRUPO-CC-292.     
                                                                        
           IF      CAD-CONTA           EQUAL       0                    
                   MOVE  1             TO          CONTA-292            
                                                   LD1-CONTA            
           ELSE                                                         
                   MOVE  CAD-CONTA     TO          CONTA-292            
                                                   LD1-CONTA.           
                                                                        
           MOVE    ZERO                TO          LD1-DIG-CTA.         
      *    DISPLAY '*    PONTO 5     *'.                                
           PERFORM 33000-VER-PRAZOS.                                    
      *    DISPLAY '*    PONTO 6     *'.                                
           MOVE    WRK-PRAZO           TO          PRAZO-292            
                                                   LD1-PRAZO.           
           MOVE    WRK-DATA-VCTO       TO          DT-MENOR-VENCTO-292  
                                                   DT-MAIOR-VENCTO-292  
                                                                        
           IF    ( CAD-MARCA-180       EQUAL   'P' OR 'Q' OR 'N' )   AND
                 ( CAD-TIPO            EQUAL       1 )                  
                   MOVE CAD-DATA-MARCA-180  TO     WRK-DATA-DMA         
                   MOVE WRK-DIA-DMA    TO          WRK-DIA-SAMD         
                   MOVE WRK-MES-DMA    TO          WRK-MES-SAMD         
                   MOVE WRK-ANO-DMA    TO          WRK-ANO-SAMD         
           ELSE                                                         
                   MOVE CAD-DTELP      TO          WRK-DATA-DMA         
                   MOVE WRK-DIA-DMA    TO          WRK-DIA-SAMD         
                   MOVE WRK-MES-DMA    TO          WRK-MES-SAMD         
                   MOVE WRK-ANO-DMA    TO          WRK-ANO-SAMD.        
      *    DISPLAY '*    PONTO 7     *'.                                
           PERFORM 31100-VERIFICAR-SITUACAO.                            
      *    DISPLAY '*    PONTO 8     *'.                                
           MOVE    CAD-CART2           TO          CARTEIRA-292         
                                                   LD1-CARTEIRA.        
           IF      CAD-CONTR         EQUAL         ZEROS                
                   MOVE    CAD-NUMCL         TO          CONTRATO-292   
                                                         LD1-CONTRATO   
           ELSE                                                         
                   MOVE    CAD-CONTR         TO          CONTRATO-292   
                                                         LD1-CONTRATO.  
           MOVE    ZERO                TO          LD1-DIG-CTR.         
           MOVE    CAD-VCTO            TO          WRK-DATA-DMA         
           MOVE    WRK-DIA-DMA         TO          LD1-DIA-VECTO        
           MOVE    WRK-MES-DMA         TO          LD1-MES-VECTO        
           MOVE    WRK-ANO-DMA         TO          LD1-ANO-VECTO.       
           MOVE    1                   TO          FIXO-292             
                                                   LD1-ATI-PAS.         
           MOVE    CAD-VLR-RESG        TO          VALOR-292            
                                                   WRK-VALOR.           
           MOVE    WRK-MES-DIA         TO          MES-292.             
           MOVE    WRK-ANO-DIA         TO          ANO-292.             
           MOVE    'LPCL'              TO          LPCL-292.            
                                                                        
           MOVE    CAD-EMPRESA         TO          AGENC-C-292          
                                                   LD1-JUNCAO.          
                                                                        
           IF   CAD-EMPRESA   EQUAL  6000                               
                MOVE   4132    TO      AGENC-C-292                      
                                           LD1-JUNCAO.                  
                                                                        
           IF   CAD-EMPRESA   EQUAL  6000  AND                          
                CAD-CART2     EQUAL   502  AND                          
                    CAD-EMISSAO    NOT EQUAL 'J'                        
                    MOVE   4135    TO      AGENC-C-292                  
                                           LD1-JUNCAO.                  
                                                                        
           IF   CAD-EMPRESA   EQUAL  6000  AND                          
                CAD-CART2     EQUAL   658  AND                          
                CAD-EMISSAO    NOT EQUAL 'J'                            
                    MOVE   8276    TO      AGENC-C-292                  
                                           LD1-JUNCAO.                  
                                                                        
           IF   CAD-EMPRESA   EQUAL  6000  AND                          
                CAD-EMISSAO EQUAL  'J'                                  
                        MOVE 7418   TO     AGENC-C-292                  
                                           LD1-JUNCAO.                  
                                                                        
           IF  CAD-EMPRESA          EQUAL  7000                         
               IF CAD-EMISSAO       EQUAL  ' '                          
CPM   **************OVE  5751       TO   AGENC-C-292                    
BERJ               MOVE  7370       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'F'                          
                   MOVE  7418       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'B'                          
                   MOVE  7838       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'D'                          
CPM   **************OVE  5751       TO   AGENC-C-292                    
BERJ               MOVE  7370       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'C' OR                       
                  CAD-CARTA         EQUAL  'B'                          
                   MOVE  5455       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'Q'                          
                   MOVE  7290       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'Z'                          
                   MOVE  8263       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'M'                          
                   MOVE  9787       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'X'                          
                   MOVE  9809       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'R'                          
                   MOVE  5177       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'W'                          
CPM   **************OVE  5751       TO   AGENC-C-292                    
BERJ               MOVE  7370       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'V'                          
                   MOVE  7085       TO   AGENC-C-292                    
                                         LD1-JUNCAO.                    
                                                                        
           IF  CAD-EMPRESA   EQUAL  6000    AND                         
               CAD-EMISSAO   NOT EQUAL  'J' AND                         
               CAD-NAT-OPER  EQUAL  50                                  
                        MOVE  7025  TO   AGENC-C-292                    
                                          LD1-JUNCAO.                   
                                                                        
           IF   CAD-CARTA     EQUAL  'Z' OR 'A'                         
                        MOVE 8267   TO     AGENC-C-292                  
                                           LD1-JUNCAO                   
           ELSE                                                         
           IF   CAD-CARTA     EQUAL  'B'                                
                        MOVE 5455   TO     AGENC-C-292                  
                                           LD1-JUNCAO.                  
                                                                        
           IF CAD-CARTA   EQUAL    'Z' OR 'A'                           
              MOVE    006              TO          GRUPO-CONTAB-292     
                                                   LD1-RAZAO-1          
              MOVE    019              TO          SUBGRUPO-CONTAB-292  
                                                   LD1-RAZAO-2          
              MOVE    '-'              TO          LD1-RZ-TRACO         
           ELSE                                                         
           IF      CAD-CART2   EQUAL  502 AND CAD-EMPRESA EQUAL 6000    
                   AND    CAD-EMISSAO  NOT EQUAL  'J'                   
STF                MOVE   78010           TO       WRK-RAZAO-GRUPO      
STF                MOVE   WRK-RZ-GRUPO    TO       GRUPO-CONTAB-292     
STF                MOVE   WRK-RZ-GRUPO    TO       LD1-RAZAO-1          
STF                MOVE   WRK-RZ-SUBGRUPO TO       SUBGRUPO-CONTAB-292  
STF                MOVE   WRK-RZ-SUBGRUPO TO       LD1-RAZAO-2          
STF                MOVE   '-'             TO       LD1-RZ-TRACO         
           ELSE                                                         
STF                MOVE   '-'             TO       LD1-RZ-TRACO         
STF                MOVE   CAD-RAZAO-LP    TO       WRK-RAZAO-GRUPO      
STF                MOVE   WRK-RZ-GRUPO    TO       GRUPO-CONTAB-292     
STF                MOVE   WRK-RZ-GRUPO    TO       LD1-RAZAO-1          
STF                MOVE   WRK-RZ-SUBGRUPO TO       LD1-RAZAO-2          
STF                MOVE   WRK-RZ-SUBGRUPO TO       SUBGRUPO-CONTAB-292. 
                                                                        
           IF CAD-EMISSAO       EQUAL  'C' OR                           
              CAD-CARTA         EQUAL  'B'                              
      ***ALTERACAO luis                                                 
      * E  NCL COMEÇAR COM 87 E CARTEIRA FOR IGUAL A 855 OU 857         
      *     MOVE  017                TO          SUBGRUPO-CONTAB-292    
                                                                        
              IF WRK-NCL-TESTE EQUAL 87 AND                             
                 (CAD-CART EQUAL 855 OR CAD-CART EQUAL 857)             
                      MOVE    017      TO          SUBGRUPO-CONTAB-292  
                                                   LD1-RAZAO-2          
                  ELSE                                                  
                      MOVE    025      TO          SUBGRUPO-CONTAB-292  
                                                   LD1-RAZAO-2          
              END-IF                                                    
              MOVE    006              TO          GRUPO-CONTAB-292     
                                                   LD1-RAZAO-1          
              MOVE    '-'              TO          LD1-RZ-TRACO.        
                                                                        
                                                                        
           MOVE    CAD-TPGAR           TO          GARANTIA-292         
                                                   LD1-GARANTIA.        
           MOVE    WRK-VR-LIQUIDO      TO          VALOR-292.           
                                                                        
           IF      GARANTIA-292        EQUAL       98  OR  99           
                   COMPUTE GARANTIA-292  =  ( GARANTIA-292 - 10 )       
                   MOVE    GARANTIA-292  TO        LD1-GARANTIA         
           ELSE                                                         
            IF     GARANTIA-292        EQUAL       ZEROS                
                   MOVE    22          TO          GARANTIA-292         
                                                   LD1-GARANTIA.        
      *    DISPLAY '*    PONTO 9     *'.                                
RASCPM     IF  (SITUACAO-292  EQUAL  7) OR                              
STF            (SITUACAO-292  EQUAL  6) OR                              
STF            (SITUACAO-292  EQUAL  5)                                 
STF            IF  CAD-TIPO  EQUAL  7                                   
STF                ADD 1            TO    ACU-QTDE-PREJ-MAIS-LP         
STF                ADD CAD-VLR-RESG TO    ACU-VLR-CON-PREJ-MAIS-LP      
STF            ELSE                                                     
STF              IF  CAD-MARCA-180    EQUAL 'N'                         
STF                  ADD 1            TO     ACU-QTDE-PREJ-MAIS-CL3     
STF                  ADD CAD-VLR-RESG TO     ACU-VLR-CON-PREJ-MAIS-CL3  
STF              ELSE                                                   
STF                  ADD 1            TO     ACU-QTDE-PREJ-MAIS-CL2     
STF                  ADD CAD-VLR-RESG TO     ACU-VLR-CON-PREJ-MAIS-CL2. 
                                                                        
           IF      SITUACAO-292        EQUAL   3                        
            IF     CAD-TIPO            EQUAL   7                        
                   ADD  1              TO      ACU-QTDE-PREJ-LP         
                   ADD  CAD-VLR-RESG   TO      ACU-VLR-CON-PREJ-LP      
            ELSE                                                        
             IF    CAD-MARCA-180       EQUAL   'N'                      
                   ADD   1             TO      ACU-QTDE-PREJ-CL3        
                   ADD  CAD-VLR-RESG   TO      ACU-VLR-CON-PREJ-CL3     
             ELSE                                                       
                   ADD   1             TO      ACU-QTDE-PREJ-CL2        
                   ADD  CAD-VLR-RESG   TO      ACU-VLR-CON-PREJ-CL2.    
                                                                        
           IF      SITUACAO-292        EQUAL   4                        
            IF     CAD-TIPO            EQUAL   7                        
                   ADD   1             TO      ACU-QTDE-PREJ-ANT-LP     
                   ADD  CAD-VLR-RESG   TO      ACU-VLR-CON-PREJ-ANT-LP  
            ELSE                                                        
             IF    CAD-MARCA-180       EQUAL   'N'                      
                   ADD   1             TO      ACU-QTDE-PREJ-ANT-CL3    
                   ADD  CAD-VLR-RESG   TO      ACU-VLR-CON-PREJ-ANT-CL3 
             ELSE                                                       
                   ADD   1             TO      ACU-QTDE-PREJ-ANT-CL2    
                   ADD  CAD-VLR-RESG   TO      ACU-VLR-CON-PREJ-ANT-CL2.
                                                                        
           MOVE    CAD-NCGC            TO          NRO-CGC-292.         
           MOVE    CAD-FIL             TO          FIL-CGC-292.         
           MOVE    CAD-CTR             TO          CTR-CGC-292.         
           IF    ( CAD-EMPRESA         EQUAL       4900        AND      
                   CAD-NCGC             NOT EQUAL   ZEROS )             
STF                MOVE    ZEROS       TO          GRUPO-CC-292         
STF                                                SUBGRUPO-CC-292      
                                                   CONTA-292.           
                                                                        
STF        MOVE    SPACES              TO          NOME-292             
STF                                                RESERVA-292.         
      *    DISPLAY '*    PONTO 10    *'.                                
           MOVE '99'                   TO          CLASS-OPER-292       
           MOVE  CAD-DTIOP             TO          WRK-DATA-AUX.        
           COMPUTE DT-INIC-OPER-292    =  (WRK-ANO-AUX * 10000 +        
                                           WRK-MES-AUX * 100   +        
                                           WRK-DIA-AUX).                
           MOVE  ZEROS                 TO          NRO-CGC-COOBR-292    
                                                   FIL-CGC-COOBR-292    
                                                   CTR-CGC-COOBR-292    
                                                                        
           MOVE  CAD-DATA              TO          WRK-DATA-AUX.        
                                                                        
STF        IF    CAD-FIL      NOT      EQUAL       ZEROS                
STF              MOVE         2        TO          TIPO-CLIENTE-292     
STF        ELSE                                                         
STF          IF  CAD-NCGC              EQUAL       ZEROS                
STF              MOVE         7        TO          TIPO-CLIENTE-292     
STF          ELSE                                                       
STF            IF  CAD-FIL             EQUAL       ZEROS                
STF                MOVE       1        TO          TIPO-CLIENTE-292.    
                                                                        
STF        IF  CAD-CARTA     EQUAL  'Z' OR 'A'                          
               MOVE  20           TO       NATUREZA-OPERACAO-292        
           ELSE                                                         
STF        IF  CAD-EMISSAO   EQUAL  'C' OR                              
STF            CAD-CARTA     EQUAL  'B'                                 
                                                                        
      *  E NCL COMEÇAR COM 87 E CARTEIRA FOR IGUAL A 855 OU 857         
      *   MOVE  2                TO         NATUREZA-OPERACAO-292       
                                                                        
              IF WRK-NCL-TESTE EQUAL 87 AND                             
                 (CAD-CART EQUAL 855 OR CAD-CART EQUAL 857)             
                   MOVE   2           TO      NATUREZA-OPERACAO-292     
              ELSE                                                      
STF                MOVE  12           TO      NATUREZA-OPERACAO-292     
              END-IF                                                    
STF        ELSE                                                         
STF            MOVE  1            TO       NATUREZA-OPERACAO-292        
           END-IF.                                                      
STF****        MOVE  1            TO       NATUREZA-OPERACAO-292.       
                                                                        
PIAZZA     IF     (CAD-EMPRESA         EQUAL 7000) AND                  
PIAZZA            (CAD-CART            EQUAL 288)                       
PIAZZA             MOVE  9803          TO   AGENC-C-292                 
PIAZZA                                      LD1-JUNCAO                  
PIAZZA     END-IF.                                                      
           IF      CAD-EMPRESA   EQUAL   7830                           
                   MOVE  7841          TO          AGENC-C-292          
                                                   LD1-JUNCAO           
           END-IF.                                                      
STF        MOVE  0199         TO       ORIGEM-RECURSO-292.              
STF        MOVE  21           TO       TAXA-REFERENCIAL-292.            
STF        MOVE  ZEROS        TO       VARIACAO-CAMBIAL-292.            
STF        MOVE  0012,0000000 TO       TAXA-EFETIVA-ANUAL-292.          
                                                                        
STF        IF    CAD-CDULT    EQUAL    004  OR                          
STF              CAD-CDULT    EQUAL    009  OR                          
STF              CAD-CDULT    EQUAL    054  OR                          
STF              CAD-CDULT    EQUAL    055  OR                          
STF              CAD-CDULT    GREATER  099                              
STF              MOVE         09       TO   CARAC-ESPECIAL-292          
STF        ELSE                                                         
STF              MOVE         ZEROS    TO   CARAC-ESPECIAL-292.         
                                                                        
STF        MOVE    ZEROS               TO   EXCLUSIVO-USGAAP-292        
STF                                         PRODUTO-292                 
STF                                         FAMILIA-292.                
      *    DISPLAY '*    PONTO 11    *'.                                
           MOVE    REG-292             TO          WRK-REG-AUX.         
           IF      VALOR-292  NOT LESS  ZEROS                           
           WRITE   REG-292.                                             
                                                                        
      ***  IF      CAD-VRENCVEN        GREATER     ZEROS                
           IF      WRK-VRENCVEN        GREATER     ZEROS                
                   PERFORM 31120-GRAVA-OUTRO-REG-PREJUIZO.              
                                                                        
       31000-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *---------------------------------*                               
       31100-VERIFICAR-SITUACAO SECTION.                                
      *---------------------------------*                               
                                                                        
      ***  IF      WRK-DATA-VCTO       LESS        19940630             
      ***        AND                                                    
      ***          ( CAD-NAT-OPER  = 90 OR 91 )                         
      ***        AND                                                    
      ***          CAD-EMPRESA NOT EQUAL 7000                           
      ***          CAD-EMISSAO NOT EQUAL 'K'                            
      ***          MOVE    4           TO          SITUACAO-292         
      ***                                          LD1-SITUACAO         
      ***          MOVE    28370       TO          CAD-RAZAO-LP         
      ***          GO TO  31100-99-FIM.                                 
                                                                        
            IF     CAD-EMISSAO EQUAL  'C' OR                            
                   CAD-CARTA   EQUAL  'B'                               
                   MOVE    4            TO         SITUACAO-292         
                                                   LD1-SITUACAO         
                   GO TO  31100-99-FIM.                                 
                                                                        
RASCPM      IF     CAD-CARTA   EQUAL  'Z' OR 'A'                        
RASCPM             MOVE    7            TO         SITUACAO-292         
RASCPM                                             LD1-SITUACAO         
RASCPM             GO TO  31100-99-FIM.                                 
                                                                        
STF        MOVE    DATA-DIA            TO       WRK-DATA-DMA.           
STF        MOVE    WRK-DIA-DMA         TO       WRK-DIA-SAMD.           
STF        MOVE    WRK-MES-DMA         TO       WRK-MES-SAMD.           
STF        MOVE    WRK-ANO-DMA         TO       WRK-ANO-SAMD.           
                                                                        
STF        MOVE    WRK-DATA-SAMD       TO       WRK-DATA-POOL0025.      
                                                                        
STF        MOVE    -360                TO       WRK-DIAS.               
JAPI-U     CALL    'BRAD0025'          USING    WRK-DATA-POOL0025       
STF                                             WRK-DIAS                
STF                                             WRK-DTPRAZO-D360.       
                                                                        
STF        IF  RETURN-CODE  NOT        EQUAL    ZEROS                   
STF            DISPLAY ' '                                              
STF            DISPLAY 'A POOL0025 RETORNOU COM ERRO'                   
STF            DISPLAY 'NO CALCULO DA DATA PRAZO -360'                  
STF            DISPLAY 'ASSUMIDA A DATA DO MOVIMENTO'                   
STF            MOVE    WRK-DATA-POOL0025  TO    WRK-DTPRAZO-D360.       
                                                                        
STF        MOVE    -1440               TO       WRK-DIAS.               
JAPI-U     CALL    'BRAD0025'          USING    WRK-DATA-POOL0025       
STF                                             WRK-DIAS                
STF                                             WRK-DTPRAZO-D1440.      
                                                                        
STF        IF  RETURN-CODE  NOT        EQUAL    ZEROS                   
STF            DISPLAY ' '                                              
STF            DISPLAY 'A POOL0025 RETORNOU COM ERRO'                   
STF            DISPLAY 'NO CALCULO DA DATA PRAZO -1440'                 
STF            DISPLAY 'ASSUMIDA A DATA DO MOVIMENTO'                   
STF            MOVE    WRK-DATA-POOL0025  TO    WRK-DTPRAZO-D1440.      
                                                                        
STF        IF  WRK-DATA-WRITEOFF       LESS     WRK-DTPRAZO-D1440       
STF            MOVE     6              TO       SITUACAO-292            
STF                                             LD1-SITUACAO            
STF        ELSE                                                         
STF          IF  WRK-DATA-WRITEOFF     LESS     WRK-DTPRAZO-D360        
STF              MOVE   4              TO       SITUACAO-292            
STF                                             LD1-SITUACAO            
STF          ELSE                                                       
STF              MOVE   3              TO       SITUACAO-292            
STF                                             LD1-SITUACAO.           
                                                                        
       31100-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *---------------------------------------*                         
       31120-GRAVA-OUTRO-REG-PREJUIZO SECTION.                          
      *---------------------------------------*                         
                                                                        
           MOVE    WRK-REG-AUX         TO          REG-292.             
           MOVE    CAD-CART2           TO          CARTEIRA-292         
                                                   LD1-CARTEIRA.        
           MOVE    2                   TO          FIXO-292             
                                                   LD1-ATI-PAS.         
           MOVE    CAD-VRENCVEN        TO          VALOR-292            
                                                   WRK-VALOR.           
           MOVE    WRK-MES-DIA         TO          MES-292.             
           MOVE    WRK-ANO-DIA         TO          ANO-292.             
           MOVE    'LPCL'              TO          LPCL-292.            
                                                                        
RASCPM     IF   (SITUACAO-292           EQUAL  7) OR                    
STF             (SITUACAO-292           EQUAL  6) OR                    
STF             (SITUACAO-292           EQUAL  5)                       
STF             IF  CAD-TIPO           EQUAL  7                         
STF                 ADD   1            TO     ACU-QTDE-PREJ-MAIS-LP     
STF                 ADD   WRK-VRENCVEN TO     ACU-VLR-ENC-PREJ-MAIS-LP  
STF             ELSE                                                    
STF               IF  CAD-MARCA-180    EQUAL  'N'                       
STF                   ADD   1             TO  ACU-QTDE-PREJ-MAIS-CL3    
STF                   ADD   WRK-VRENCVEN  TO  ACU-VLR-ENC-PREJ-MAIS-CL3 
STF               ELSE                                                  
STF                   ADD   1             TO  ACU-QTDE-PREJ-MAIS-CL2    
STF                   ADD   WRK-VRENCVEN  TO  ACU-VLR-ENC-PREJ-MAIS-CL2.
                                                                        
           MOVE    CAD-EMPRESA     TO      AGENC-C-292                  
                                           LD1-JUNCAO.                  
                                                                        
           IF   CAD-EMPRESA    EQUAL  6000                              
                    MOVE   4132    TO      AGENC-C-292                  
                                           LD1-JUNCAO.                  
                                                                        
           IF   CAD-EMPRESA    EQUAL  6000  AND                         
                CAD-CART2      EQUAL   502  AND                         
                    CAD-EMISSAO    NOT EQUAL 'J'                        
                    MOVE   4135    TO      AGENC-C-292                  
                                           LD1-JUNCAO.                  
                                                                        
           IF   CAD-EMPRESA    EQUAL  6000  AND                         
                CAD-CART2      EQUAL   658  AND                         
                    CAD-EMISSAO    NOT EQUAL  'J'                       
                    MOVE   8276    TO      AGENC-C-292                  
                                           LD1-JUNCAO.                  
                                                                        
           IF   CAD-EMPRESA    EQUAL  6000  AND                         
                CAD-EMISSAO EQUAL  'J'                                  
                    MOVE   7418    TO      AGENC-C-292                  
                                           LD1-JUNCAO.                  
                                                                        
           IF  CAD-EMPRESA          EQUAL  7000                         
               IF CAD-EMISSAO       EQUAL  ' '                          
CPM   **************OVE  5751       TO   AGENC-C-292                    
BERJ               MOVE  7370       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'F'                          
                   MOVE  7418       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'B'                          
                   MOVE  7838       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'D'                          
CPM   **************OVE  5751       TO   AGENC-C-292                    
                   MOVE  7370       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'C' OR                       
                  CAD-CARTA         EQUAL  'B'                          
                   MOVE  5455       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'Q'                          
                   MOVE  7290       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'Z'                          
                   MOVE  8263       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'M'                          
                   MOVE  9787       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'X'                          
                   MOVE  9809       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'R'                          
                   MOVE  5177       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'W'                          
CPM   **************OVE  5751       TO   AGENC-C-292                    
BERJ               MOVE  7370       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'V'                          
                   MOVE  7085       TO   AGENC-C-292                    
                                         LD1-JUNCAO.                    
                                                                        
           IF  CAD-EMPRESA   EQUAL  6000  AND                           
               CAD-EMISSAO   NOT EQUAL  'J' AND                         
               CAD-NAT-OPER  EQUAL  50                                  
                        MOVE  7025  TO   AGENC-C-292                    
                                          LD1-JUNCAO.                   
                                                                        
           IF   CAD-CARTA      EQUAL  'Z' OR 'A'                        
                    MOVE   8267    TO      AGENC-C-292                  
                                           LD1-JUNCAO                   
           ELSE                                                         
           IF   CAD-CARTA      EQUAL  'B'                               
                    MOVE   5455    TO      AGENC-C-292                  
                                           LD1-JUNCAO.                  
                                                                        
           IF      CAD-EMPRESA   EQUAL   7830                           
                   MOVE  7841          TO          AGENC-C-292          
                                                   LD1-JUNCAO           
           END-IF.                                                      
                                                                        
PIAZZA     IF     (CAD-EMPRESA         EQUAL 7000) AND                  
PIAZZA            (CAD-CART            EQUAL 288)                       
PIAZZA             MOVE  9803          TO   AGENC-C-292                 
PIAZZA                                      LD1-JUNCAO                  
PIAZZA     END-IF.                                                      
                                                                        
           IF CAD-CARTA   EQUAL    'Z' OR 'A'                           
              MOVE    006              TO          GRUPO-CONTAB-292     
                                                   LD1-RAZAO-1          
              MOVE    019              TO          SUBGRUPO-CONTAB-292  
                                                   LD1-RAZAO-2          
              MOVE    '-'              TO          LD1-RZ-TRACO         
           ELSE                                                         
           IF      CAD-CART2  EQUAL  502 AND CAD-EMPRESA EQUAL 6000     
                   AND  CAD-EMISSAO NOT EQUAL  'J'                      
STF                MOVE  78010              TO   WRK-RAZAO-GRUPO        
STF                MOVE   WRK-RZ-GRUPO      TO   GRUPO-CONTAB-292       
STF                MOVE   WRK-RZ-GRUPO      TO   LD1-RAZAO-1            
STF                MOVE   WRK-RZ-SUBGRUPO   TO   SUBGRUPO-CONTAB-292    
STF                MOVE   WRK-RZ-SUBGRUPO   TO   LD1-RAZAO-2            
STF                MOVE   '-'               TO   LD1-RZ-TRACO           
           ELSE                                                         
STF                MOVE   '-'               TO   LD1-RZ-TRACO           
STF                MOVE  CAD-RZRENDAS       TO   WRK-RAZAO-GRUPO        
STF                MOVE   WRK-RZ-GRUPO      TO   LD1-RAZAO-1            
STF                MOVE   WRK-RZ-GRUPO      TO   GRUPO-CONTAB-292       
STF                MOVE   WRK-RZ-SUBGRUPO   TO   LD1-RAZAO-2            
STF                MOVE   WRK-RZ-SUBGRUPO   TO   SUBGRUPO-CONTAB-292.   
                                                                        
           IF CAD-EMISSAO       EQUAL  'C' OR                           
              CAD-CARTA         EQUAL  'B'                              
                                                                        
      ***ALTERACAO luis                                                 
      * E  NCL COMEÇAR COM 87 E CARTEIRA FOR IGUAL A 855 OU 857         
      *     MOVE  017                TO          SUBGRUPO-CONTAB-292    
                                                                        
              IF WRK-NCL-TESTE EQUAL 87 AND                             
                 (CAD-CART EQUAL 855 OR CAD-CART EQUAL 857)             
                      MOVE    017      TO          SUBGRUPO-CONTAB-292  
                                                   LD1-RAZAO-2          
                  ELSE                                                  
                      MOVE    025      TO          SUBGRUPO-CONTAB-292  
                                                   LD1-RAZAO-2          
              END-IF                                                    
                                                                        
              MOVE    006              TO          GRUPO-CONTAB-292     
                                                   LD1-RAZAO-1          
              MOVE    '-'              TO          LD1-RZ-TRACO.        
                                                                        
                                                                        
           IF      SITUACAO-292        EQUAL   3                        
            IF     CAD-TIPO            EQUAL   7                        
                   ADD   1             TO      ACU-QTDE-PREJ-LP         
                   ADD   WRK-VRENCVEN  TO      ACU-VLR-ENC-PREJ-LP      
            ELSE                                                        
             IF    CAD-MARCA-180       EQUAL   'N'                      
                   ADD   1             TO      ACU-QTDE-PREJ-CL3        
                   ADD   WRK-VRENCVEN  TO      ACU-VLR-ENC-PREJ-CL3     
             ELSE                                                       
                   ADD   1             TO      ACU-QTDE-PREJ-CL2        
                   ADD   WRK-VRENCVEN  TO      ACU-VLR-ENC-PREJ-CL2.    
                                                                        
           IF      SITUACAO-292        EQUAL   4                        
            IF     CAD-TIPO            EQUAL   7                        
                   ADD   1             TO      ACU-QTDE-PREJ-ANT-LP     
                   ADD   WRK-VRENCVEN  TO      ACU-VLR-ENC-PREJ-ANT-LP  
            ELSE                                                        
             IF    CAD-MARCA-180       EQUAL   'N'                      
                   ADD   1             TO      ACU-QTDE-PREJ-ANT-CL3    
                   ADD   WRK-VRENCVEN  TO      ACU-VLR-ENC-PREJ-ANT-CL3 
             ELSE                                                       
                   ADD   1             TO      ACU-QTDE-PREJ-ANT-CL2    
                   ADD   WRK-VRENCVEN  TO      ACU-VLR-ENC-PREJ-ANT-CL2.
                                                                        
           IF      CAD-VRENCVEN  GREATER  ZEROS                         
           WRITE   REG-292.                                             
                                                                        
       31120-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *-----------------------------------*                             
       32000-GRAVA-OUTRO-REGISTRO SECTION.                              
      *-----------------------------------*                             
                                                                        
           MOVE    WRK-REG-AUX         TO          REG-292.             
           MOVE    CAD-CART2           TO          CARTEIRA-292         
                                                   LD1-CARTEIRA.        
           MOVE    2                   TO          FIXO-292             
                                                   LD1-ATI-PAS.         
           MOVE    CAD-VRENCVEN        TO          VALOR-292            
                                                   WRK-VALOR.           
                                                                        
           ADD     1                   TO          ACU-QTDE-CL          
           ADD     CAD-VRENCVEN        TO          ACU-VLR-ENC-CL.      
                                                                        
           MOVE    WRK-MES-DIA         TO          MES-292.             
           MOVE    WRK-ANO-DIA         TO          ANO-292.             
           MOVE    'LPCL'              TO          LPCL-292.            
                                                                        
           MOVE    CAD-EMPRESA     TO      AGENC-C-292                  
                                           LD1-JUNCAO.                  
                                                                        
           IF   CAD-EMPRESA    EQUAL  6000                              
                    MOVE   4132    TO      AGENC-C-292                  
                                           LD1-JUNCAO.                  
                                                                        
           IF   CAD-EMPRESA    EQUAL  6000  AND                         
                CAD-CART2      EQUAL   502  AND                         
                    CAD-EMISSAO    NOT EQUAL  'J'                       
                    MOVE   4135    TO      AGENC-C-292                  
                                           LD1-JUNCAO.                  
                                                                        
           IF   CAD-EMPRESA    EQUAL  6000  AND                         
                CAD-CART2      EQUAL   658  AND                         
                    CAD-EMISSAO    NOT EQUAL  'J'                       
                    MOVE   8276    TO      AGENC-C-292                  
                                           LD1-JUNCAO.                  
                                                                        
           IF   CAD-EMPRESA    EQUAL  6000  AND                         
                CAD-EMISSAO  EQUAL  'J'                                 
                       MOVE  7418  TO      AGENC-C-292                  
                                           LD1-JUNCAO.                  
                                                                        
                                                                        
           IF  CAD-EMPRESA          EQUAL  7000                         
               IF CAD-EMISSAO       EQUAL  ' '                          
CPM   **************OVE  5751       TO   AGENC-C-292                    
BERJ               MOVE  7370       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'F'                          
                   MOVE  7418       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'B'                          
                   MOVE  7838       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'D'                          
CPM   **************OVE  5751       TO   AGENC-C-292                    
BERJ               MOVE  7370       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'C' OR                       
                  CAD-CARTA         EQUAL  'B'                          
                   MOVE  5455       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'Q'                          
                   MOVE  7290       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'Z'                          
                   MOVE  8263       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'M'                          
                   MOVE  9787       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'X'                          
                   MOVE  9809       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'R'                          
                   MOVE  5177       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'W'                          
CPM   **************OVE  5751       TO   AGENC-C-292                    
BERJ               MOVE  7370       TO   AGENC-C-292                    
                                         LD1-JUNCAO                     
               ELSE                                                     
               IF CAD-EMISSAO       EQUAL  'V'                          
                   MOVE  7085       TO   AGENC-C-292                    
                                         LD1-JUNCAO.                    
                                                                        
           IF  CAD-EMPRESA   EQUAL  6000  AND                           
               CAD-EMISSAO NOT EQUAL  'J'  AND                          
               CAD-NAT-OPER  EQUAL  50                                  
                        MOVE  7025  TO   AGENC-C-292                    
                                          LD1-JUNCAO.                   
                                                                        
           IF   CAD-CARTA      EQUAL  'Z' OR 'A'                        
                       MOVE  8267  TO      AGENC-C-292                  
                                           LD1-JUNCAO.                  
                                                                        
           IF      CAD-EMPRESA   EQUAL   7830                           
                   MOVE  7841          TO          AGENC-C-292          
                                                   LD1-JUNCAO           
           END-IF.                                                      
                                                                        
PIAZZA     IF     (CAD-EMPRESA         EQUAL 7000) AND                  
PIAZZA            (CAD-CART            EQUAL 288)                       
PIAZZA             MOVE  9803          TO   AGENC-C-292                 
PIAZZA                                      LD1-JUNCAO                  
PIAZZA     END-IF.                                                      
                                                                        
           IF CAD-CARTA   EQUAL    'Z' OR 'A'                           
              MOVE    006              TO          GRUPO-CONTAB-292     
                                                   LD1-RAZAO-1          
              MOVE    019              TO          SUBGRUPO-CONTAB-292  
                                                   LD1-RAZAO-2          
              MOVE    '-'              TO          LD1-RZ-TRACO         
           ELSE                                                         
           IF      CAD-CART2  EQUAL  502 AND CAD-EMPRESA EQUAL 6000     
                   AND  CAD-EMISSAO NOT EQUAL  'J'                      
STF                MOVE  78010              TO   WRK-RAZAO-GRUPO        
STF                MOVE   WRK-RZ-GRUPO      TO   GRUPO-CONTAB-292       
STF                MOVE   WRK-RZ-GRUPO      TO   LD1-RAZAO-1            
STF                MOVE   WRK-RZ-SUBGRUPO   TO   SUBGRUPO-CONTAB-292    
STF                MOVE   WRK-RZ-SUBGRUPO   TO   LD1-RAZAO-2            
STF                MOVE   '-'               TO   LD1-RZ-TRACO           
           ELSE                                                         
STF                MOVE   '-'               TO   LD1-RZ-TRACO           
STF                MOVE  CAD-RZRENDAS       TO   WRK-RAZAO-GRUPO        
STF                MOVE   WRK-RZ-GRUPO      TO   GRUPO-CONTAB-292       
STF                MOVE   WRK-RZ-GRUPO      TO   LD1-RAZAO-1            
STF                MOVE   WRK-RZ-SUBGRUPO   TO   LD1-RAZAO-2            
STF                MOVE   WRK-RZ-SUBGRUPO   TO   SUBGRUPO-CONTAB-292.   
                                                                        
           IF CAD-EMISSAO       EQUAL  'C' OR                           
              CAD-CARTA         EQUAL  'B'                              
                                                                        
      ***ALTERACAO luis                                                 
      * E  NCL COMEÇAR COM 87 E CARTEIRA FOR IGUAL A 855 OU 857         
      *     MOVE  017                TO          SUBGRUPO-CONTAB-292    
                                                                        
              IF WRK-NCL-TESTE EQUAL 87 AND                             
                 (CAD-CART EQUAL 855 OR CAD-CART EQUAL 857)             
                      MOVE    017      TO          SUBGRUPO-CONTAB-292  
                                                   LD1-RAZAO-2          
                  ELSE                                                  
                      MOVE    025      TO          SUBGRUPO-CONTAB-292  
                                                   LD1-RAZAO-2          
              END-IF                                                    
                                                                        
              MOVE    006              TO          GRUPO-CONTAB-292     
                                                   LD1-RAZAO-1          
              MOVE    '-'              TO          LD1-RZ-TRACO.        
                                                                        
           WRITE   REG-292.                                             
                                                                        
       32000-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *-------------------------*                                       
       33000-VER-PRAZOS SECTION.                                        
      *-------------------------*                                       
                                                                        
           MOVE    CAD-VCTO            TO          WRK-DATA-DMA         
           MOVE    WRK-DIA-DMA         TO          WRK-DIA-VCTO         
           MOVE    WRK-MES-DMA         TO          WRK-MES-VCTO         
           MOVE    WRK-ANO-DMA         TO          WRK-ANO-VCTO.        
                                                                        
           MOVE    WRK-DATA-VCTO       TO          WRK-DATA-SAMD.       
                                                                        
STF        MOVE    DATA-DIA            TO          WRK-DATA-BASE.       
STF        MOVE    CAD-VCTO            TO          WRK-DATA-VENCTO.     
                                                                        
STF        CALL    WRK-MODULO          USING       WRK-DATA-BASE        
STF                                                WRK-DATA-VENCTO      
STF                                                WRK-PRAZO.           
       33000-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *-------------------------*                                       
       40000-VER-QUEBRA SECTION.                                        
      *-------------------------*                                       
                                                                        
           IF      CAD-AG              NOT EQUAL   WRK-AGENCIA-ANT      
                   MOVE    'S'         TO          WRK-IMPRIMIR         
                   MOVE    CAD-AG      TO          WRK-AGENCIA-ANT      
                   ADD     ACU-TOTAL-AGEN          TO ACU-TOTAL-GERAL   
                   MOVE    ZEROS       TO          WRK-CONT-LIN         
                   ADD     1           TO          WRK-CONT-PAG         
                   PERFORM 41100-IMPRIMIR-CABEC1                        
                   PERFORM 41200-IMPRIMIR-CABEC2                        
                   MOVE    ZEROS       TO          ACU-TOTAL-AGEN       
                   ADD     WRK-VALOR   TO          ACU-TOTAL-AGEN       
                   PERFORM 42000-VER-AGENCIA                            
           ELSE                                                         
                   PERFORM 41000-IMPRIMIR-RELPEND                       
                   ADD     WRK-VALOR   TO           ACU-TOTAL-AGEN.     
                                                                        
       40000-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *------------------------------*                                  
       41000-IMPRIMIR-RELPEND SECTION.                                  
      *------------------------------*                                  
                                                                        
           IF      CAD-AG              NOT EQUAL   95     AND           
                   WRK-CONT-95         GREATER     50000                
                   GO  TO  41000-99-FIM.                                
                                                                        
           IF      WRK-CONT-LIN        GREATER     60                   
                   MOVE    'S'         TO          WRK-IMPRIMIR         
                   MOVE    ZEROS       TO          WRK-CONT-LIN         
                   ADD     1           TO          WRK-CONT-PAG         
                   PERFORM 41100-IMPRIMIR-CABEC1                        
                   PERFORM 41200-IMPRIMIR-CABEC2.                       
                                                                        
           PERFORM 41300-IMPRIMIR-LINDET.                               
                                                                        
       41000-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *------------------------------*                                  
       41100-IMPRIMIR-CABEC1 SECTION.                                   
      *------------------------------*                                  
                                                                        
           IF      CAD-AG              NOT EQUAL   95     AND           
                   WRK-CONT-95         GREATER     50000                
                   GO  TO  41100-99-FIM.                                
                                                                        
           MOVE    WRK-DIA-SYS         TO          CB1-DIA-PEND.        
           MOVE    WRK-MES-SYS         TO          CB1-MES-PEND.        
           MOVE    WRK-ANO-SYS         TO          CB1-ANO-PEND.        
                                                                        
           MOVE    WRK-HH-SYS          TO          CB1-HH               
           MOVE    WRK-MM-SYS          TO          CB1-MM               
           MOVE    WRK-SS-SYS          TO          CB1-SS               
                                                                        
           MOVE    WRK-CONT-PAG        TO          CB1-PAG              
                                                                        
           WRITE   REG-RELPEND         FROM        CABEC1-PEND.         
                                                                        
           MOVE    CAD-MOVTO           TO          WRK-DATA-MOVTO       
           MOVE    WRK-DIA-MOVTO       TO          CB2-DIA-BASE         
           MOVE    WRK-MES-MOVTO       TO          CB2-MES-BASE         
           MOVE    WRK-ANO-MOVTO       TO          CB2-ANO-BASE         
                                                                        
           WRITE   REG-RELPEND         FROM        CABEC2-PEND.         
                                                                        
           ADD     3                   TO          WRK-CONT-LIN.        
                                                                        
       41100-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *------------------------------*                                  
       41200-IMPRIMIR-CABEC2 SECTION.                                   
      *------------------------------*                                  
                                                                        
           IF      CAD-AG              NOT EQUAL   95     AND           
                   WRK-CONT-95         GREATER     50000                
                   GO  TO  41200-99-FIM.                                
                                                                        
           WRITE   REG-RELPEND         FROM        CABEC3-PEND.         
           WRITE   REG-RELPEND         FROM        WRK-BRANCO.          
           WRITE   REG-RELPEND         FROM        WRK-BRANCO.          
                                                                        
           ADD     5                   TO          WRK-CONT-LIN.        
                                                                        
       41200-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *------------------------------*                                  
       41300-IMPRIMIR-LINDET SECTION.                                   
      *------------------------------*                                  
                                                                        
           IF      WRK-IMPRIMIR        EQUAL       'S'                  
                   MOVE    'N'         TO          WRK-IMPRIMIR         
           ELSE                                                         
                   MOVE    SPACES      TO          LD1-EMPRESA-X        
                                                   LD1-JUNCAO-X         
                                                   LD1-RAZAO-X.         
                                                                        
           MOVE    WRK-VALOR           TO          LD1-VALOR.           
                                                                        
           WRITE   REG-RELPEND         FROM        LINDET1.             
                                                                        
           ADD     1                   TO          WRK-CONT-95.         
           ADD     1                   TO          WRK-CONT-LIN.        
                                                                        
       41300-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *--------------------------*                                      
       42000-VER-AGENCIA SECTION.                                       
      *--------------------------*                                      
                                                                        
           IF      CAD-AG              EQUAL       95                   
                   PERFORM 41300-IMPRIMIR-LINDET.                       
                                                                        
       42000-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *-----------------------------*                                   
       43000-IMPR-TOT-GERAL SECTION.                                    
      *-----------------------------*                                   
                                                                        
           MOVE    ACU-TOTAL-GERAL     TO          LT1-TOTAL-GERAL.     
                                                                        
           WRITE   REG-RELPEND         FROM        LINTOT1.             
                                                                        
       43000-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *----------------------------*                                    
       50000-GRAVA-ARQSORT SECTION.                                     
      *----------------------------*                                    
                                                                        
           IF      WRK-EMP-ANT         EQUAL       5240                 
                   MOVE   7036         TO          SRT-EMPRESA          
           ELSE                                                         
                   MOVE   WRK-EMP-ANT  TO          SRT-EMPRESA.         
                                                                        
      *---------------------------------------------------------------* 
                                                                        
      *--------- GRAVA CL ----------*                                   
                                                                        
           MOVE    ACU-QTDE-CL         TO          SRT-QTDE.            
           COMPUTE SRT-VLR-CONTABIL = ACU-VLR-CON-CL - ACU-VLR-ENC-CL   
           MOVE    ACU-VLR-ENC-CL      TO          SRT-VLR-ENC-VENC.    
           MOVE    ACU-VLR-CON-CL      TO          SRT-VLR-TOTAL.       
           MOVE    1                   TO          SRT-TIPO.            
           MOVE    1                   TO          SRT-EXERCICIO.       
                                                                        
           RELEASE REG-SORT.                                            
                                                                        
STF   *---- GRAVA LP ANTERIOR (MAIS DE 48 MESES) ----*                  
                                                                        
STF        MOVE    ACU-QTDE-PREJ-MAIS-LP     TO    SRT-QTDE             
STF        COMPUTE SRT-VLR-CONTABIL = ACU-VLR-CON-PREJ-MAIS-LP          
STF                                 - ACU-VLR-ENC-PREJ-MAIS-LP.         
STF        MOVE    ACU-VLR-ENC-PREJ-MAIS-LP  TO    SRT-VLR-ENC-VENC.    
STF        MOVE    ACU-VLR-CON-PREJ-MAIS-LP  TO    SRT-VLR-TOTAL.       
STF        MOVE    2                         TO    SRT-TIPO.            
STF        MOVE    3                         TO    SRT-EXERCICIO.       
                                                                        
STF        RELEASE REG-SORT.                                            
                                                                        
STF   *---- GRAVA CL3 ANTERIOR (MAIS DE 48 MESES) ----*                 
                                                                        
STF        MOVE    ACU-QTDE-PREJ-MAIS-CL3    TO    SRT-QTDE.            
STF        COMPUTE SRT-VLR-CONTABIL = ACU-VLR-CON-PREJ-MAIS-CL3         
STF                                 - ACU-VLR-ENC-PREJ-MAIS-CL3.        
STF        MOVE    ACU-VLR-ENC-PREJ-MAIS-CL3 TO    SRT-VLR-ENC-VENC.    
STF        MOVE    ACU-VLR-CON-PREJ-MAIS-CL3 TO    SRT-VLR-TOTAL.       
STF        MOVE    3                         TO    SRT-TIPO.            
STF        MOVE    3                         TO    SRT-EXERCICIO.       
                                                                        
STF        RELEASE REG-SORT.                                            
                                                                        
STF   *---- GRAVA CL2 ANTERIOR (MAIS DE 48 MESES) ----*                 
                                                                        
STF        MOVE    ACU-QTDE-PREJ-MAIS-CL2    TO    SRT-QTDE.            
STF        COMPUTE SRT-VLR-CONTABIL = ACU-VLR-CON-PREJ-MAIS-CL2         
STF                                 - ACU-VLR-ENC-PREJ-MAIS-CL2.        
STF        MOVE    ACU-VLR-ENC-PREJ-MAIS-CL2 TO    SRT-VLR-ENC-VENC.    
STF        MOVE    ACU-VLR-CON-PREJ-MAIS-CL2 TO    SRT-VLR-TOTAL.       
STF        MOVE    4                         TO    SRT-TIPO.            
STF        MOVE    3                         TO    SRT-EXERCICIO.       
                                                                        
STF        RELEASE REG-SORT.                                            
                                                                        
                                                                        
                                                                        
                                                                        
                                                                        
                                                                        
      *---------------------------------------------------------------* 
                                                                        
      *------ GRAVA LP ATUAL -----*                                     
                                                                        
           MOVE    ACU-QTDE-PREJ-LP     TO         SRT-QTDE.            
           COMPUTE SRT-VLR-CONTABIL =                                   
                   ACU-VLR-CON-PREJ-LP - ACU-VLR-ENC-PREJ-LP            
           MOVE    ACU-VLR-ENC-PREJ-LP  TO         SRT-VLR-ENC-VENC.    
           MOVE    ACU-VLR-CON-PREJ-LP  TO         SRT-VLR-TOTAL.       
           MOVE    2                    TO         SRT-TIPO.            
           MOVE    1                    TO         SRT-EXERCICIO.       
                                                                        
           RELEASE REG-SORT.                                            
                                                                        
      *----- GRAVA LP ANTERIOR ----*                                    
                                                                        
           MOVE    ACU-QTDE-PREJ-ANT-LP     TO     SRT-QTDE.            
           COMPUTE SRT-VLR-CONTABIL =                                   
                   ACU-VLR-CON-PREJ-ANT-LP  - ACU-VLR-ENC-PREJ-ANT-LP   
           MOVE    ACU-VLR-ENC-PREJ-ANT-LP  TO     SRT-VLR-ENC-VENC.    
           MOVE    ACU-VLR-CON-PREJ-ANT-LP  TO     SRT-VLR-TOTAL.       
           MOVE    2                    TO         SRT-TIPO.            
           MOVE    2                    TO         SRT-EXERCICIO.       
                                                                        
           RELEASE REG-SORT.                                            
                                                                        
                                                                        
      *---------------------------------------------------------------* 
                                                                        
      *------ GRAVA CL3 ATUAL -----*                                    
                                                                        
           MOVE    ACU-QTDE-PREJ-CL3    TO         SRT-QTDE.            
           COMPUTE SRT-VLR-CONTABIL =                                   
                   ACU-VLR-CON-PREJ-CL3  - ACU-VLR-ENC-PREJ-CL3.        
           MOVE    ACU-VLR-ENC-PREJ-CL3 TO         SRT-VLR-ENC-VENC.    
           MOVE    ACU-VLR-CON-PREJ-CL3 TO         SRT-VLR-TOTAL.       
           MOVE    3                    TO         SRT-TIPO.            
           MOVE    1                    TO         SRT-EXERCICIO.       
                                                                        
           RELEASE REG-SORT.                                            
                                                                        
      *---- GRAVA CL3 ANTERIOR ----*                                    
                                                                        
           MOVE    ACU-QTDE-PREJ-ANT-CL3    TO     SRT-QTDE.            
           COMPUTE SRT-VLR-CONTABIL =                                   
                   ACU-VLR-CON-PREJ-ANT-CL3 - ACU-VLR-ENC-PREJ-ANT-CL3. 
           MOVE    ACU-VLR-ENC-PREJ-ANT-CL3 TO     SRT-VLR-ENC-VENC.    
           MOVE    ACU-VLR-CON-PREJ-ANT-CL3 TO     SRT-VLR-TOTAL.       
           MOVE    3                        TO     SRT-TIPO.            
           MOVE    2                        TO     SRT-EXERCICIO.       
                                                                        
           RELEASE REG-SORT.                                            
                                                                        
                                                                        
      *---------------------------------------------------------------* 
                                                                        
      *----- GRAVA CL2 ATUAL -----*                                     
                                                                        
           MOVE    ACU-QTDE-PREJ-CL2    TO         SRT-QTDE.            
      *****MOVE    ACU-VLR-CON-PREJ-CL2 TO         SRT-VLR-CONTABIL.    
           COMPUTE SRT-VLR-CONTABIL =                                   
                   ACU-VLR-CON-PREJ-CL2 - ACU-VLR-ENC-PREJ-CL2.         
           MOVE    ACU-VLR-ENC-PREJ-CL2 TO         SRT-VLR-ENC-VENC.    
      *****COMPUTE ACU-VLR-TOT-PREJ-CL2 =                               
      *****        ACU-VLR-CON-PREJ-CL2 + ACU-VLR-ENC-PREJ-CL2.         
      *****MOVE    ACU-VLR-TOT-PREJ-CL2 TO         SRT-VLR-TOTAL.       
           MOVE    ACU-VLR-CON-PREJ-CL2 TO         SRT-VLR-TOTAL.       
           MOVE    4                    TO         SRT-TIPO.            
           MOVE    1                    TO         SRT-EXERCICIO.       
                                                                        
           RELEASE REG-SORT.                                            
                                                                        
      *---- GRAVA CL2 ANTERIOR ----*                                    
                                                                        
           MOVE    ACU-QTDE-PREJ-ANT-CL2    TO     SRT-QTDE.            
      *****MOVE    ACU-VLR-CON-PREJ-ANT-CL2 TO     SRT-VLR-CONTABIL.    
           COMPUTE SRT-VLR-CONTABIL =                                   
                   ACU-VLR-CON-PREJ-ANT-CL2 - ACU-VLR-ENC-PREJ-ANT-CL2. 
           MOVE    ACU-VLR-ENC-PREJ-ANT-CL2 TO     SRT-VLR-ENC-VENC.    
      *****COMPUTE ACU-VLR-TOT-PREJ-ANT-CL2 =                           
      *****        ACU-VLR-CON-PREJ-ANT-CL2 + ACU-VLR-ENC-PREJ-ANT-CL2. 
      *****MOVE    ACU-VLR-TOT-PREJ-ANT-CL2 TO     SRT-VLR-TOTAL.       
           MOVE    ACU-VLR-CON-PREJ-ANT-CL2 TO     SRT-VLR-TOTAL.       
           MOVE    4                    TO         SRT-TIPO.            
           MOVE    2                    TO         SRT-EXERCICIO.       
                                                                        
           RELEASE REG-SORT.                                            
                                                                        
      *---------------------------------------------------------------* 
                                                                        
           MOVE    0                   TO      ACU-QTDE-CL              
                                               ACU-VLR-CON-CL           
                                               ACU-VLR-ENC-CL           
                                               ACU-VLR-TOT-CL           
                                               ACU-QTDE-PREJ-LP         
                                               ACU-VLR-CON-PREJ-LP      
                                               ACU-VLR-ENC-PREJ-LP      
                                               ACU-VLR-TOT-PREJ-LP      
                                               ACU-QTDE-PREJ-ANT-LP     
                                               ACU-VLR-CON-PREJ-ANT-LP  
                                               ACU-VLR-ENC-PREJ-ANT-LP  
                                               ACU-VLR-TOT-PREJ-ANT-LP  
                                               ACU-QTDE-PREJ-CL2        
                                               ACU-VLR-CON-PREJ-CL2     
                                               ACU-VLR-ENC-PREJ-CL2     
                                               ACU-VLR-TOT-PREJ-CL2     
                                               ACU-QTDE-PREJ-ANT-CL2    
                                               ACU-VLR-CON-PREJ-ANT-CL2 
                                               ACU-VLR-ENC-PREJ-ANT-CL2 
                                               ACU-VLR-TOT-PREJ-ANT-CL2 
                                               ACU-QTDE-PREJ-CL3        
                                               ACU-VLR-CON-PREJ-CL3     
                                               ACU-VLR-ENC-PREJ-CL3     
                                               ACU-VLR-TOT-PREJ-CL3     
                                               ACU-QTDE-PREJ-ANT-CL3    
                                               ACU-VLR-CON-PREJ-ANT-CL3 
                                               ACU-VLR-ENC-PREJ-ANT-CL3 
                                               ACU-VLR-TOT-PREJ-ANT-CL3 
                                               ACU-QTDE-PREJ-MAIS-LP    
                                               ACU-VLR-CON-PREJ-MAIS-LP 
                                               ACU-VLR-ENC-PREJ-MAIS-LP 
                                               ACU-QTDE-PREJ-MAIS-CL3   
                                               ACU-VLR-CON-PREJ-MAIS-CL3
                                               ACU-VLR-ENC-PREJ-MAIS-CL3
                                               ACU-QTDE-PREJ-MAIS-CL2   
                                               ACU-VLR-CON-PREJ-MAIS-CL2
                                              ACU-VLR-ENC-PREJ-MAIS-CL2.
                                                                        
       50000-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *----------------------*                                          
       60000-IMPRIME SECTION.                                           
      *----------------------*                                          
                                                                        
           PERFORM 61000-LER-ARQSORT.                                   
                                                                        
           PERFORM 62000-GERA-RELATO   UNTIL       SRT-EMPRESA          
                                       EQUAL       99999                
                                       AND         SRT-TIPO             
                                       EQUAL       9.                   
                                                                        
           PERFORM 63000-IMPRIMIR-RELATO.                               
           PERFORM 64000-ACUM-VLR-TOT-TIPO                              
           PERFORM 65000-ACUM-VLR-TOT-EMPRESA                           
           PERFORM 66000-IMPRIMIR-TOT-TIPO                              
           PERFORM 67000-IMPRIMIR-TOT-EMPRESA                           
           PERFORM 70000-ACUM-VLR-TOT-GERAL                             
           PERFORM 80000-IMPRIMIR-TOTAL-GERAL.                          
                                                                        
       60000-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *--------------------------*                                      
       61000-LER-ARQSORT SECTION.                                       
      *--------------------------*                                      
                                                                        
           RETURN  ARQSORT             AT          END                  
                   MOVE    99999       TO          SRT-EMPRESA          
                   MOVE    9           TO          SRT-TIPO.            
                                                                        
JAPI-I     ADD 1 TO CB-ON-002                                           
JAPI-I     IF  CB-ON-002 = 1                                            
                   MOVE  SRT-EMPRESA   TO          WRK-EMPRESA-ANT      
                   MOVE  SRT-TIPO      TO          WRK-TIPO-ANT         
                   MOVE  SRT-EXERCICIO TO          WRK-EXER-ANT.        
                                                                        
       61000-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *--------------------------*                                      
       62000-GERA-RELATO SECTION.                                       
      *--------------------------*                                      
                                                                        
           IF      SRT-EMPRESA         EQUAL       WRK-EMPRESA-ANT      
            IF     SRT-TIPO            EQUAL       WRK-TIPO-ANT         
             IF    SRT-EXERCICIO       EQUAL       WRK-EXER-ANT         
                   PERFORM 62100-ACUM-VLR-TOT-EXERCICIO                 
             ELSE                                                       
                   PERFORM 63000-IMPRIMIR-RELATO                        
                   PERFORM 64000-ACUM-VLR-TOT-TIPO                      
                   PERFORM 65000-ACUM-VLR-TOT-EMPRESA                   
                   PERFORM 62200-ZERAR-ACUM-EXERCICIO                   
                   MOVE    SRT-EXERCICIO  TO       WRK-EXER-ANT         
                   PERFORM 62100-ACUM-VLR-TOT-EXERCICIO                 
            ELSE                                                        
                   PERFORM 63000-IMPRIMIR-RELATO                        
                   PERFORM 64000-ACUM-VLR-TOT-TIPO                      
                   PERFORM 65000-ACUM-VLR-TOT-EMPRESA                   
                   PERFORM 66000-IMPRIMIR-TOT-TIPO                      
                   PERFORM 62200-ZERAR-ACUM-EXERCICIO                   
                   PERFORM 68000-ZERAR-ACUM-TIPO                        
                   MOVE    SRT-EXERCICIO  TO       WRK-EXER-ANT         
                   MOVE    SRT-TIPO    TO          WRK-TIPO-ANT         
                   PERFORM 62100-ACUM-VLR-TOT-EXERCICIO                 
           ELSE                                                         
                   PERFORM 63000-IMPRIMIR-RELATO                        
                   PERFORM 64000-ACUM-VLR-TOT-TIPO                      
                   PERFORM 65000-ACUM-VLR-TOT-EMPRESA                   
                   PERFORM 70000-ACUM-VLR-TOT-GERAL                     
                   PERFORM 66000-IMPRIMIR-TOT-TIPO                      
                   PERFORM 67000-IMPRIMIR-TOT-EMPRESA                   
                   PERFORM 62200-ZERAR-ACUM-EXERCICIO                   
                   PERFORM 68000-ZERAR-ACUM-TIPO                        
                   PERFORM 69000-ZERAR-ACUM-EMPRESA                     
                   MOVE    SRT-EXERCICIO  TO       WRK-EXER-ANT         
                   MOVE    SRT-TIPO    TO          WRK-TIPO-ANT         
                   MOVE    SRT-EMPRESA TO          WRK-EMPRESA-ANT      
                   MOVE    61          TO          ACU-LIN              
                   PERFORM 62100-ACUM-VLR-TOT-EXERCICIO.                
                                                                        
           PERFORM 61000-LER-ARQSORT.                                   
                                                                        
       62000-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *-------------------------------------*                           
       62100-ACUM-VLR-TOT-EXERCICIO SECTION.                            
      *-------------------------------------*                           
                                                                        
           ADD     SRT-QTDE            TO          ACU-EX-QTDE.         
           ADD     SRT-VLR-CONTABIL    TO          ACU-EX-VLR-CON.      
           ADD     SRT-VLR-ENC-VENC    TO          ACU-EX-VLR-ENC.      
           ADD     SRT-VLR-TOTAL       TO          ACU-EX-VLR-TOT.      
                                                                        
       62100-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *-----------------------------------*                             
       62200-ZERAR-ACUM-EXERCICIO SECTION.                              
      *-----------------------------------*                             
                                                                        
           MOVE    ZEROS               TO          ACU-EX-QTDE          
                                                   ACU-EX-VLR-CON       
                                                   ACU-EX-VLR-ENC       
                                                   ACU-EX-VLR-TOT.      
       62200-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *------------------------------*                                  
       63000-IMPRIMIR-RELATO SECTION.                                   
      *------------------------------*                                  
                                                                        
           IF      ACU-LIN             GREATER     60                   
                   ADD     1           TO          ACU-PAG              
                   MOVE    ZEROS       TO          ACU-LIN              
                   PERFORM 63100-IMPRIMIR-CABEC.                        
                                                                        
           PERFORM 63200-IMPRIMIR-LINDET.                               
                                                                        
       63000-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *-----------------------------*                                   
       63100-IMPRIMIR-CABEC SECTION.                                    
      *-----------------------------*                                   
                                                                        
           WRITE   REL-REG             FROM        CABEC1-REL           
           WRITE   REL-REG             FROM        DETB.                
           WRITE   REL-REG             FROM        CABEC2-REL           
           WRITE   REL-REG             FROM        DETB.                
                                                                        
       63100-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *------------------------------*                                  
       63200-IMPRIMIR-LINDET SECTION.                                   
      *------------------------------*                                  
                                                                        
           MOVE    WRK-EMPRESA-ANT     TO          DET1-EMPR.           
           MOVE    ACU-EX-QTDE         TO          DET1-QTDE.           
           MOVE    ACU-EX-VLR-CON      TO          DET1-VRCONT.         
           MOVE    ACU-EX-VLR-ENC      TO          DET1-VRENCVEN.       
           MOVE    ACU-EX-VLR-TOT      TO          DET1-VRTOT.          
                                                                        
           PERFORM 63210-TIPO-OBSERVACAO.                               
                                                                        
           WRITE   REL-REG             FROM        DET1.                
           ADD     1                   TO          ACU-LIN.             
                                                                        
       63200-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *------------------------------*                                  
       63210-TIPO-OBSERVACAO SECTION.                                   
      *------------------------------*                                  
                                                                        
STF        IF      WRK-TIPO-ANT        EQUAL       2                    
STF         IF     WRK-EXER-ANT        EQUAL       1                    
STF                MOVE 'LP ATE 12M'   TO          DET1-OBS             
STF         ELSE                                                        
STF          IF    WRK-EXER-ANT        EQUAL       2                    
STF                MOVE 'LP 13 A 48M'  TO          DET1-OBS             
STF          ELSE                                                       
STF           IF   WRK-EXER-ANT        EQUAL       3                    
STF                MOVE 'LP MAIS 48M'  TO          DET1-OBS.            
                                                                        
STF        IF      WRK-TIPO-ANT        EQUAL       3                    
STF         IF     WRK-EXER-ANT        EQUAL       1                    
STF                MOVE 'CL3 ATE 12M'  TO          DET1-OBS             
STF         ELSE                                                        
STF          IF    WRK-EXER-ANT        EQUAL       2                    
STF                MOVE 'CL3 13 A 48M'  TO         DET1-OBS             
STF          ELSE                                                       
STF           IF   WRK-EXER-ANT        EQUAL       3                    
STF                MOVE 'CL3 MAIS 48M'  TO         DET1-OBS.            
                                                                        
STF        IF      WRK-TIPO-ANT        EQUAL       4                    
STF         IF     WRK-EXER-ANT        EQUAL       1                    
STF                MOVE 'CL2 ATE 12M'  TO          DET1-OBS             
STF         ELSE                                                        
STF          IF    WRK-EXER-ANT        EQUAL       2                    
STF                MOVE 'CL2 13 A 48M'  TO         DET1-OBS             
STF          ELSE                                                       
STF           IF   WRK-EXER-ANT        EQUAL       3                    
STF                MOVE 'CL2 MAIS 48M'  TO         DET1-OBS.            
                                                                        
                                                                        
       63210-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *--------------------------------*                                
       64000-ACUM-VLR-TOT-TIPO SECTION.                                 
      *--------------------------------*                                
                                                                        
           ADD     ACU-EX-QTDE         TO          ACU-TP-QTDE.         
           ADD     ACU-EX-VLR-CON      TO          ACU-TP-VLR-CON.      
           ADD     ACU-EX-VLR-ENC      TO          ACU-TP-VLR-ENC.      
           ADD     ACU-EX-VLR-TOT      TO          ACU-TP-VLR-TOT.      
                                                                        
       64000-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *-----------------------------------*                             
       65000-ACUM-VLR-TOT-EMPRESA SECTION.                              
      *-----------------------------------*                             
                                                                        
           ADD     ACU-EX-QTDE         TO          ACU-EMP-QTDE.        
           ADD     ACU-EX-VLR-CON      TO          ACU-EMP-VLR-CON.     
           ADD     ACU-EX-VLR-ENC      TO          ACU-EMP-VLR-ENC.     
           ADD     ACU-EX-VLR-TOT      TO          ACU-EMP-VLR-TOT.     
                                                                        
       65000-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *--------------------------------*                                
       66000-IMPRIMIR-TOT-TIPO SECTION.                                 
      *--------------------------------*                                
                                                                        
           MOVE    ACU-TP-QTDE         TO          TOT1-QTDE.           
           MOVE    ACU-TP-VLR-CON      TO          TOT1-VRCONT.         
           MOVE    ACU-TP-VLR-ENC      TO          TOT1-VRENCVEN.       
           MOVE    ACU-TP-VLR-TOT      TO          TOT1-VRTOT.          
                                                                        
           WRITE   REL-REG             FROM        DETB.                
           WRITE   REL-REG             FROM        TOTAL1-TIPO.         
           WRITE   REL-REG             FROM        DETB.                
                                                                        
       66000-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *----------------------------------*                              
       67000-IMPRIMIR-TOT-EMPRESA SECTION.                              
      *----------------------------------*                              
                                                                        
           MOVE    ACU-EMP-QTDE        TO          TOT2-QTDE.           
           MOVE    ACU-EMP-VLR-CON     TO          TOT2-VRCONT.         
           MOVE    ACU-EMP-VLR-ENC     TO          TOT2-VRENCVEN.       
           MOVE    ACU-EMP-VLR-TOT     TO          TOT2-VRTOT.          
                                                                        
           WRITE   REL-REG             FROM        TOTAL2-EMPRESA.      
                                                                        
       67000-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *------------------------------*                                  
       68000-ZERAR-ACUM-TIPO SECTION.                                   
      *------------------------------*                                  
                                                                        
           MOVE    ZEROS               TO          ACU-TP-QTDE          
                                                   ACU-TP-VLR-CON       
                                                   ACU-TP-VLR-ENC       
                                                   ACU-TP-VLR-TOT.      
       68000-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *---------------------------------*                               
       69000-ZERAR-ACUM-EMPRESA SECTION.                                
      *---------------------------------*                               
                                                                        
           MOVE    ZEROS               TO          ACU-EMP-QTDE         
                                                   ACU-EMP-VLR-CON      
                                                   ACU-EMP-VLR-ENC      
                                                   ACU-EMP-VLR-TOT.     
       69000-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      *---------------------------------*                               
       70000-ACUM-VLR-TOT-GERAL SECTION.                                
      *---------------------------------*                               
                                                                        
           ADD     ACU-EMP-QTDE        TO          ACU-GER-QTDE.        
           ADD     ACU-EMP-VLR-CON     TO          ACU-GER-VLR-CON.     
           ADD     ACU-EMP-VLR-ENC     TO          ACU-GER-VLR-ENC.     
           ADD     ACU-EMP-VLR-TOT     TO          ACU-GER-VLR-TOT.     
                                                                        
       70000-99-FIM. EXIT.                                              
      *-------------------*                                             
                                                                        
      /-----------------------------------*                             
       80000-IMPRIMIR-TOTAL-GERAL SECTION.                              
      *-----------------------------------*                             
                                                                        
           MOVE    ACU-GER-QTDE        TO          TOT3-QTDE.           
           MOVE    ACU-GER-VLR-CON     TO          TOT3-VRCONT.         
           MOVE    ACU-GER-VLR-ENC     TO          TOT3-VRENCVEN.       
           MOVE    ACU-GER-VLR-TOT     TO          TOT3-VRTOT.          
                                                                        
           WRITE   REL-REG             FROM        TOTAL3-GERAL.        
                                                                        
       80000-99-FIM. EXIT.                                              
      *-------------------*                                             
