       01  CADUV000.
      *    *************************************************************
           10 CCLUB                PIC S9(10)V USAGE COMP-3.
      *    *************************************************************
           10 CID-TPO-PSSOA        PIC X(1).
      *    *************************************************************
           10 CCPF-CNPJ            PIC S9(9)V USAGE COMP-3.
      *    *************************************************************
           10 CCTRL-CPF-CNPJ       PIC S9(2)V USAGE COMP-3.
      *    *************************************************************
           10 CFLIAL-CPF-CNPJ      PIC S9(4)V USAGE COMP-3.
      *    *************************************************************
           10 DNASC-FUNDC          PIC X(10).
      *    *************************************************************
           10 CAG-COBR-TARIF       PIC S9(5)V USAGE COMP-3.
      *    *************************************************************
           10 CCTA-COBR-TARIF      PIC S9(13)V USAGE COMP-3.
      *    *************************************************************
           10 HULT-ATULZ           PIC X(26).
      *    *************************************************************
           10 ELOGDR-PSSOA         PIC X(70).
      *    *************************************************************
           10 ELOGDR-NRO           PIC X(7).
      *    *************************************************************
           10 RCOMPL-ENDER         PIC X(30).
      *    *************************************************************
           10 EBAIRO-ENDER         PIC X(40).
      *    *************************************************************
           10 ICIDDE-ENDER         PIC X(40).
      *    *************************************************************
           10 CSGL-UF              PIC X(2).
      *    *************************************************************
           10 CCEP                 PIC S9(5)V USAGE COMP-3.
      *    *************************************************************
           10 CCEP-COMPL           PIC S9(3)V USAGE COMP-3.
      *    *************************************************************
           10 CFONE                PIC S9(8)V USAGE COMP-3.
      *    *************************************************************
           10 CDDI                 PIC X(4).
      *    *************************************************************
           10 CDDD                 PIC X(4).
      *    *************************************************************

